/**
 * product name CRDS(Credit Risk Decision System)
 */
package crds.pub.util;

/**
 * @specification Excel用代码名称映射表
 * @version 1.0
 * @author banlibo
 * @date Sep 12, 2008 10:29:25 AM
 * @email banlibo@beyondsoft.com
 */
public class ExcelDataSourceMapping {
	/**
	说明:XXXXX=下面英文
	1.公司类别		downlist_companyType_array
	2.全球行业代码一级	downlist_globalTradeCodeFirst_array
	3.货币类型	downlist_currencyType_array
	4.货币单位	downlist_currencyUnit_array
	5.报表涵盖期间 	downlist_reportPeriod_array
	6.报表口径		downlist_reportEntity_array
	7.报表审计意见   	downlist_reportAudit_array  
	8.基本信息标题	HEADER_TITLE
	9.财务信息报表头标题	FIN_TITLE_INFO
	10.一般企业资产负债标题	 EVALUATION_ICOMMONBS_INFO
	11.一般企业利润标题	EVALUATION_ICOMMONPL_INFO
	12.一般企业现金流量标题  EVALUATION_ICOMMONCF_INFO
	13.银行资产负债 EVALUATION_BANKBS_INFO
	14.银行利润  EVALUATION_BANKPL_INFO
	15.银行现金流量 EVALUATION_BANKCF_INFO
	16.证券资产负债  EVALUATION_SECURITYBS_INFO
	17.证券利润    EVALUATION_SECURITYPL_INFO
	18.证券现金流量 EVALUATION_SECURITYCF_INFO
	19.保险资产负债 EVALUATION_INSURANCEBS_INFO
	20.保险利润   EVALUATION_INSURANCEPL_INFO
	21.保险现金流量 EVALUATION_INSURANCECF_INFO
	22.公司性质  downlist_companyProperty_array
	*/

	/***********************
	1.公司类别
	***********************/
	public static final String[][] downlist_companyType_array={
		{"ET","一般企业"},
		{"BT","银行"},
		{"ST","证券"},
		{"IT","保险"}
    };
					       							       					       					
	/***********************
	2.全球行业代码一级
	***********************/
	public static final String[][] downlist_globalTradeCodeFirst_array={
	   {"10000000","能源"},
       {"15000000","原材料"},
       {"20000000","工业"},
       {"25000000","消费者相机选购品"},
       {"30000000","日常消费品"},
       {"35000000","医疗保健"},
       {"40000000","金融"},
       {"45000000","信息科技"},
       {"50000000","电信业务"},				       
       {"55000000","公用事业"}
	};

	/***********************
	3.货币类型		       
	***********************/
	public static final String[][] downlist_currencyType_array={
	   {"CNY","人民币"},
       {"HKD","港币"},
       {"USD","美元"},
       {"JPY","日元"},
       {"EUR","欧元"}
	};	
	/***********************
	4.货币单位		       
	***********************/
	public static final String[][] downlist_currencyUnit_array={
	   {"YUAN","元"},
       {"KYUAN","千元"},
       {"TKYUAN","万元"}
	};
	/***********************
	5.报表涵盖期间
	***********************/
	public static final String[][] downlist_reportPeriod_array={
	   {"03","3个月"},
       {"06","6个月"},
       {"09","9个月"},				       
       {"12","12个月"}
	};
	/***********************
	6.报表口径
	***********************/
	public static final String[][] downlist_reportEntity_array={
	    {"11","集团合并"},
       	{"21","集团本部"},
//       	{"03","非集团"},
//       	{"04","集团合并(不完整信息)"}
	};
	/***********************
	7.报表审计意见 
	***********************/
	public static final String[][] downlist_Fin_Audit_array={
       {"A0","未审计"},
	   {"A1","无保留意见"},
       {"A2","保留意见"},
   	   {"A3","标准无保留意见"},				       
 	   {"A4","否定意见"},
  	   {"A5","无法表达意见"}
	};
	
	/***********************
	8.基本信息标题		
	***********************/
	public static final String[] HEADER_TITLE = new String[]{
		"基本信息",
		"公司名称",
		"公司类别",
		"行业类别",
		"企业性质",
		"注册日期",
		"注册地区",
		"主营业务",
		"集团名称",
		"年营业收入",
		"公司总资产",
		"法人代表",
		"总经理"
	};
	
	/***********************
	9.财务信息报表头标题		
	***********************/
	public static final String[] FIN_TITLE_INFO = new String[] {
		"报表头",
		"报表日期",
		"报表口径",
		"涵盖月份",
		"币种",
		"货币单位",
		"审计机构",
		"审计意见",
		"补充说明"
	};
	
	/***********************
	10.一般企业资产负债标题	
	***********************/
	public static final String[] EVALUATION_ICOMMONBS_INFO = new String[] {
		"一般企业资产负债表","货币资金","保证金存款","质押存款","交易性金融资产(短期投资)","债券",
		"股票","已质押的交易性金融资产(短期投资)","已计提交易性金融资产(短期投资)跌价准备","应收票据","应收账款","应收关联公司贸易款",
		"已计提坏账准备1","预付款项","预付贸易款项","应收利息","应收股利","其他应收款",
		"关联公司拆借款","股东或董事个人拆借款","已计提坏账准备2","存货","原材料","在产品",
		"库存商品","待出售物业","非持续经营相关的存货","已计提存货跌价准备","一年内到期的非流动资产","其他流动资产",
		"流动资产合计","可供出售金融资产","持有至到期投资(长期债权投资)","长期应收款","长期股权投资","投资性房地产",
		"其他长期投资","长期投资合计","固定资产(净值)","房屋、建筑物","机器设备","运输工具",
		"固定资产减值准备","固定资产净额","在建工程","工程物资","固定资产清理","生产性生物资产",
		"油气资产","固定资产合计","无形资产","已计提累计摊销","无形资产减值准备","开发支出",
		"商誉","长期待摊费用","递延所得税资产","其他非流动资产","非流动资产合计","资产总计",
		"短期借款","交易性金融负债","债券","应付票据","应付账款","应付关联公司贸易款",
		"预收款项","预收贸易款项","应付职工薪酬","应交税费","应付利息","应付股利",
		"其他应付款","关联公司垫款","股东或董事个人垫款","一年内到期的非流动负债","长期金融机构借款","融资租赁负债",
		"其他流动负债","流动负债合计","长期借款","向金融机构借款","向关联公司借款","向股东或董事个人借款",
		"应付债券","长期应付款","专项应付款","预计负债","递延所得税负债","其他非流动负债",
		"非流动负债合计","负债合计","实收资本(或股本)","资本公积","评估增值","减：库存股",
		"盈余公积","法定盈余公积","未分配利润","外币报表折算差额","归属于母公司所有者权益(或股东权益)合计","少数股东权益",
		"所有者权益(或股东权益)合计","负债及所有者权益合计","经营性租赁承诺","一年内应支付的最低租金","2-5年(含)内应支付的最低租金","5年后应支付的最低租金",
		"财务担保","信用证","贴现期票","法律诉讼或税务申索金额","资产证券化","资本支出承诺",
		"已批准但尚未签约的资本承诺","已签约但尚未拨备的资本承诺","其他表外负债","表外负债合计"
	};
	
	/***********************
	11.一般企业利润标题		
	***********************/
	public static final String[] EVALUATION_ICOMMONPL_INFO = new String[] {
		"一般企业利润表","营业收入","营业成本","营业税金及附加","其他业务利润(2001年表項目)","销售费用",
		"管理费用","董事酬金","研发费用","租金","折旧","无形资产摊销",
		"诉讼费","投资收益(损失以“-”号填列)","对联营企业和合营企业的投资收益","出售股票、债券、票据、基金等金融资产收益","红利及利息","外汇投资收益",
		"资产减值损失(减值准备)","坏帐损失","存货跌价损失","可供出售金融资产减值损失","持有至到期投资减值损失","公允价值变动收益",
		"投资性房地产公允价值变动收益","可出售金融资产公允价值变动收益","息税前营业利润(EBIT)","固定资产折旧","无形资产摊销","待摊费用减少",
		"息税折旧摊销前营业利润(EBITDA)","财务费用","利息收入","利息支出","汇兑损益","手续费",
		"营业利润","营业外收入","营业外支出","非流动资产处置损失","利润总额(亏损总额“-”号填列)","所得税费用",
		"当期所得税","递延所得税","净利润","少数股东损益","归属于母公司所有者的净利润","年初未分配利润",
		"其他转入","提取其他及利润归还投资","可分配利润","提取法定盈余公积","提取法定公益金","职工奖金福利",
		"提取企业发展基金","提取储备基金","可供投资者分配的利润","应付优先股股利","提取任意盈余公积","应付普通股股利",
		"转作资本(或股本)的普通股股利","未分配利润"
	};
	
	/***********************
	12.一般企业现金流量标题		
	***********************/
	public static final String[] EVALUATION_ICOMMONCF_INFO = new String[] {
		"一般企业现金流量表","销售商品、提供劳务收到的现金","收到的税费返还","收到其他与经营活动有关的现金","经营活动现金流入小计","购买商品、接受劳务支付的现金",
		"支付给职工以及为职工支付的现金","支付的各项税费","支付其他与经营活动有关的现金","经营活动现金流出小计","经营活动产生的现金流量净额","收回投资收到的现金",
		"取得投资收益收到的现金","处置固定资产、无形资产和其他长期资产收回的现金净额","处置子公司及其他营业单位收到的现金净额","收到其他与投资活动有关的现金","投资活动现金流入小计","购建固定资产、无形资产和其他长期资产支付的现金",
		"投资支付的现金","取得子公司及其他营业单位支付的现金净额","支付其他与投资活动有关的现金","投资活动现金流出小计","投资活动产生的现金流量净额","吸收投资收到的现金",
		"取得借款收到的现金","收到其他与筹资活动有关的现金","筹资活动现金流入小计","偿还债务支付的现金","分配股利、利润或偿付利息支付的现金","支付其他与筹资活动有关的现金",
		"筹资活动现金流出小计","筹资活动产生的现金流量净额","汇率变动对现金的影响","现金及现金等价物净增加额","期初现金及现金等价物余额","期末现金及现金等价物余额",
		"净利润","加：资产减值准备","固定资产折旧、油气资产折耗、生产性生物资产折旧","无形资产摊销","长期待摊费用摊销","处置固定、无形资产和其他长期资产的损失",
		"固定资产报废损失","公允价值变动损失","财务费用","投资损失","递延所得税资产减少","递延所得税负债增加",
		"存货的减少","经营性应收项目的减少","经营性应付项目的增加","其他","经营活动产生的现金流净额","债务转为资本",
		"一年内到期的可转换公司债券","融资租入固定资产","现金的期末余额","减：现金的期初余额","加：现金等价物的期末余额","减：现金等价物的期初余额",
		"(间接法)现金及现金等价物净增加额"
	};
	/**********************
	 13.银行资产负债标题
	***********************/
	public static final String[] EVALUATION_BANKBS_INFO=new String[]{
		"商业银行资产负债表","现金及存放中央银行款项","存放同业款项","贵金属","拆出资金",
		"交易性金融资产","衍生金融资产","买入返售金融资产","应收利息","发放贷款及垫款",
		"可供出售金融资产","持有至到期投资","长期股权投资","投资性房地产","固定资产",
		"无形资产","递延所得税资产","其他资产","资产总计","向中央银行借款","同业及其他机构存放款项",
		"拆入资金","交易性金融负债","衍生金融负债","卖出回购金融资产款","吸收存款","应付职工薪酬",
		"应交税费","应付利息","预计负债","应付债券","递延所得税负债","其他负债","负债合计",
		"实收资本(或股本)","资本公积","减：库存股","盈余公积","一般风险准备","未分配利润",
		"所有者权益(或股东权益)合计","负债和所有者权益(或股东权益)总计"
	};
	/**********************
	 14.银行利润标题
	***********************/
	public static final String[] EVALUATION_BANKPL_INFO=new String[]{
		"商业银行利润表","营业收入","利息净收入","利息收入","利息支出",
		"手续费及佣金净收入","手续费及佣金收入","手续费及佣金支出","投资收益(损失以“－”填列)",
		"其中：对联营企业和合营企业的投资收益","公允价值表动收益(损失以“－”填列)",
		"汇兑收益(损失以“－”填列)","其他业务收入","营业支出","营业税金及附加",
		"业务及管理费","资产减值损失","其他业务成本","营业利润","加：营业外收入",
		"减：营业外支出","利润总额","减：所得税费用","净利润"
	};
	
	/**********************
	 15.银行现金流量标题
	***********************/
	public static final String[] EVALUATION_BANKCF_INFO=new String[]{
		"商业银行现金流量表","客户存款和同业存放款项净增加额","向中央银行借款净增加额",
		"向其他金融机构拆入资金净增加额","收取利息、手续费及佣金的现金","收到其他与经营活动有关的现金",
		"经营活动现金流入小计","客户贷款及垫款净增加额","存放央行和同业款项净增加额",
		"支付手续费及佣金的现金","支付给职工以及为职工支付的现金","支付的各项税费",
		"支付其他与经营活动有关的现金","经营活动现金流出小计","经营活动产生的现金流量净额",
		"收回投资收到的现金","取得投资收益收到的现金","收到其他与投资活动有关的现金",
		"投资活动现金流入小计","投资支付的现金","购建固定资产、无形资产和其他长期资产支付的现金",
		"支付其他与投资活动有关的现金","投资活动现金流出小计","投资活动产生的现金流量净额",
		"吸收投资收到的现金","发行债券收到的现金","收到其他与筹资活动有关的现金","筹资活动现金流入小计",
		"偿还债务支付的现金","分配股利、利润或偿付利息支付的现金","支付其他与筹资活动有关的现金",
		"筹资活动现金流出小计","筹资活动产生的现金流量净额","四、汇率变动对现金的影响","五、现金及现金等价物净增加额",
		"期初现金及现金等价物余额","六、期末现金及现金等价物余额","净利润","加：资产减值准备",
		"固定资产折旧、油气资产折耗、生产性生物资产折旧","无形资产摊销","长期待摊费用摊销",
		"处置固定、无形资产和其他长期资产的损失","固定资产报废损失","公允价值变动损失","财务费用",
		"投资损失","递延所得税资产减少","递延所得税负债增加","存货的减少","经营性应收项目的减少","经营性应付项目的增加",
		"其他","经营活动产生的现金流净额","债务转为资本","一年内到期的可转换公司债券","融资租入固定资产",
		"现金的期末余额","减：现金的期初余额","加：现金等价物的期末余额","减：现金等价物的期初余额",
		"现金及现金等价物净增加额"
	};
	/**********************
	 16.证券财务信息的资产负债
	 * *******************/
	public static final String[] EVALUATION_SECURITYBS_INFO=new String[]{
		"证券公司资产负债表","货币资金","其中：客户资金存款","结算备付金","其中：客户备付金","拆出资金","交易性金融资产",
		"衍生金融资产","买入返售金融资产","应收利息","存出保证金","可供出售金融资产","持有至到期投资","长期股权投资","投资性房地产","固定资产","无形资产",
		"其中：交易席位费","递延所得税资产","其他资产","资产总计","短期借款","其中：质押借款","拆入资金","交易性金融负债","衍生金融负债","卖出回购金融资产款",
		"代理买卖证券款","代理承销证券款","应付职工薪酬","应交税费","应付利息","预计负债","长期借款","应付债券","递延所得税负债","其他负债","负债合计",
		"实收资本(或股本)","资本公积","减：库存股","盈余公积","一般风险准备","未分配利润","所有者权益(或股东权益)合计","负债及所有者权益合计"
	};
	/**********************
	 17.证券财务信息的利润
	 * *******************/
	public static final String[] EVALUATION_SECURITYPL_INFO=new String[]{
		"证券公司利润表","营业收入","手续费及佣金收入","其中：代理买卖证券业务净收入","其中：证券承销业务净收入","其中：受托客户资产管理业务净收入","利息净收入",
		"投资收益(损失以“－”填列)","其中：对联营企业和合营企业的投资收益","公允价值表动收益(损失以“－”填列)","汇兑收益(损失以“－”填列)","其他业务收入",
		"营业支出","营业税金及附加","业务及管理费","资产减值损失","其他业务成本","营业利润","加：营业外收入","减：营业外支出","利润总额","减：所得税费用","净利润"
	};
	/**********************
	 1８.证券财务信息的现金流量
	 * *******************/
	public static final String[] EVALUATION_SECURITYCF_INFO=new String[]{
		"证券公司现金流量表","处置交易性金融资产净增加额","收取利息、手续费及佣金的现金",	
		"拆入资金净增加额","回购业务资金净增加额",	"收到其他与经营活动有关的现金",	
		"经营活动现金流入小计",	"支付利息、手续费及佣金的现金","支付给职工以及为职工支付的现金",	
		"支付的各项税费","支付其他与经营活动有关的现金","经营活动现金流出小计",	
		"经营活动产生的现金流量净额","收回投资收到的现金","取得投资收益收到的现金",	
		"收到其他与投资活动有关的现金","投资活动现金流入小计","投资支付的现金",	
		"购建固定资产、无形资产和其他长期资产支付的现金","支付其他与投资活动有关的现金",	
		"投资活动现金流出小计",	"投资活动产生的现金流量净额","吸收投资收到的现金",	
		"发行债券收到的现金","收到其他与筹资活动有关的现金",	"筹资活动现金流入小计",	
		"偿还债务支付的现金","分配股利、利润或偿付利息支付的现金","支付其他与筹资活动有关的现金",	
		"筹资活动现金流出小计",	"筹资活动产生的现金流量净额","四、汇率变动对现金的影响","五、现金及现金等价物净增加额",	
		"期初现金及现金等价物余额","六、期末现金及现金等价物余额","净利润","加：资产减值准备",	
		"固定资产折旧、油气资产折耗、生产性生物资产折旧","无形资产摊销","长期待摊费用摊销",	
		"处置固定、无形资产和其他长期资产的损失","固定资产报废损失","公允价值变动损失","财务费用",	
		"投资损失","递延所得税资产减少","递延所得税负债增加","存货的减少",	"经营性应收项目的减少",	
		"经营性应付项目的增加",	"其他","经营活动产生的现金流净额","债务转为资本","一年内到期的可转换公司债券",	
		"融资租入固定资产","现金的期末余额","减：现金的期初余额","加：现金等价物的期末余额",	
		"减：现金等价物的期初余额","现金及现金等价物净增加额"
	};
	/**********************
	 1９.保险财务信息的资产负债
	 * *******************/
	public static final String[] EVALUATION_INSURANCEBS_INFO=new String[]{
		"保险公司资产负债表","货币资金","拆出资金","交易性金融资产",
		"衍生金融资产","买入返售金融资产","应收利息","应收保费",
		"应收代位追偿款","应收分保账款","应收分保未到期责任准备金",
		"应收分保未决赔款准备金","应收分保寿险责任准备金","应收分保长期健康险责任准备金",
		"保户质押贷款","定期存款","可供出售金融资产","持有至到期投资","长期股权投资",
		"存出资本保证金","投资性房地产","固定资产","无形资产","独立账户资产",
		"递延所得税资产","其他资产","资产总计","短期借款","拆入资金","交易性金融负债",
		"衍生金融负债","卖出回购金融资产款","预收保费","应付手续费及佣金","应付分保账款",
		"应付职工薪酬","应交税费","应付赔付款","应付保单红利","保户储金及投资款",
		"未到期责任准备金","未决赔款准备金","寿险责任准备金","长期健康险责任准备金",
		"长期借款","应付债券","独立账户负债","递延所得税负债","其他负债","负债合计",
		"实收资本(或股本)","资本公积","减：库存股","盈余公积","一般风险准备",
		"未分配利润","所有者权益(或股东权益)合计","负债和所有者权益(或股东权益)总计",
   		
	};
	/**********************
	 20.保险财务信息的利润
	 * *******************/
	public static final String[] EVALUATION_INSURANCEPL_INFO=new String[]{
		"保险公司利润表","营业收入","已赚保费","保险业务收入","其中：分保费收入","减：分出保费","提取未到期责任准备金","投资收益(损失以“－”填列)",
		"其中：对联营企业和合营企业的投资收益","公允价值表动收益(损失以“－”填列)","汇兑收益(损失以“－”填列)","其他业务收入","营业支出",
		"退保金","赔付支出","减：摊回赔付支出","提取保险责任准备金","减：摊回保险责任准备金","保单红利支出","分保费用","营业税金及附加",
		"手续费及佣金支出","业务及管理费","减：摊回分保费用","其他业务成本","资产减值损失","营业利润","营业外收入","减：营业外支出","利润总额",
		"减：所得税费用","净利润"
	};
	/**********************
	 21.保险财务信息的现金流量
	 * *******************/
	public static final String[] EVALUATION_INSURANCECF_INFO=new String[]{
		"保险公司现金流量表",	"收到原保险合同保费取得的现金",	"收到再保业务现金净额","保户储金净增加额","收到其他与经营活动有关的现金",
		"经营活动现金流入小计","支付原保险合同赔付款项的现金","支付手续费的现金","支付保单红利的现金","支付给职工以及为职工支付的现金","支付的各项税费",
		"支付其他与经营活动有关的现金","经营活动现金流出小计","经营活动产生的现金流量净额","收回投资收到的现金","取得投资收益收到的现金",
		"收到其他与投资活动有关的现金","投资活动现金流入小计","投资支付的现金","质押贷款净增加额","购建固定资产、无形资产和其他长期资产支付的现金",
		"支付其他与投资活动有关的现金","投资活动现金流出小计","投资活动产生的现金流量净额","吸收投资收到的现金","发行债券收到的现金",
		"收到其他与筹资活动有关的现金","筹资活动现金流入小计","偿还债务支付的现金","分配股利、利润或偿付利息支付的现金","支付其他与筹资活动有关的现金",
		"筹资活动现金流出小计","筹资活动产生的现金流量净额","四、汇率变动对现金的影响","五、现金及现金等价物净增加额","期初现金及现金等价物余额",
		"六、期末现金及现金等价物余额","净利润","加：资产减值准备","固定资产折旧、油气资产折耗、生产性生物资产折旧","无形资产摊销","长期待摊费用摊销",
		"处置固定、无形资产和其他长期资产的损失","固定资产报废损失","公允价值变动损失","财务费用","投资损失","递延所得税资产减少","递延所得税负债增加",
		"存货的减少","经营性应收项目的减少","经营性应付项目的增加","其他","经营活动产生的现金流净额","债务转为资本","一年内到期的可转换公司债券",
		"融资租入固定资产","现金的期末余额","减：现金的期初余额","加：现金等价物的期末余额","减：现金等价物的期初余额","现金及现金等价物净增加额",
	};

	/***********************
	22.公司性质
	***********************/
	public static final String[][] downlist_companyProperty_array={
	    {"GY","国有控股"},
       	{"JT","集体企业"},
       	{"MY","民营企业"},
       	{"WZ","外资控股企业"}
	};
	/***********************
	22.省市信息
	***********************/
	public static final String[][] downlist_region_array={
		{"1101","北京市"},
		{"1201","天津市"},
		{"1301","石家庄市"},
		{"1302","唐山市"},
		{"1303","秦皇岛市"},
		{"1304","邯郸市"},
		{"1305","邢台市"},
		{"1306","保定市"},
		{"1307","张家口市"},
		{"1308","承德市"},
		{"1309","沧州市"},
		{"1310","廊坊市"},
		{"1311","衡水市"},
		{"1401","太原市"},
		{"1402","大同市"},
		{"1403","阳泉市"},
		{"1404","长治市"},
		{"1405","晋城市"},
		{"1406","朔州市"},
		{"1407","晋中市"},
		{"1408","运城市"},
		{"1409","忻州市"},
		{"1410","临汾市"},
		{"1411","吕梁市"},
		{"1501","呼和浩特市"},
		{"1502","包头市"},
		{"1503","乌海市"},
		{"1504","赤峰市"},
		{"1505","通辽市"},
		{"1506","鄂尔多斯市"},
		{"1507","呼伦贝尔市"},
		{"1508","巴彦淖尔市"},
		{"1509","乌兰察布市"},
		{"1522","兴安盟"},
		{"1525","锡林郭勒盟"},
		{"1529","阿拉善盟"},
		{"2101","沈阳市"},
		{"2102","大连市"},
		{"2103","鞍山市"},
		{"2104","抚顺市"},
		{"2105","本溪市"},
		{"2106","丹东市"},
		{"2107","锦州市"},
		{"2108","营口市"},
		{"2109","阜新市"},
		{"2110","辽阳市"},
		{"2111","盘锦市"},
		{"2112","铁岭市"},
		{"2113","朝阳市"},
		{"2114","葫芦岛市"},
		{"2201","长春市"},
		{"2202","吉林市"},
		{"2203","四平市"},
		{"2204","辽源市"},
		{"2205","通化市"},
		{"2206","白山市"},
		{"2207","松原市"},
		{"2208","白城市"},
		{"2224","延边朝鲜族自治州"},
		{"2301","哈尔滨市"},
		{"2302","齐齐哈尔市"},
		{"2303","鸡西市"},
		{"2304","鹤岗市"},
		{"2305","双鸭山市"},
		{"2306","大庆市"},
		{"2307","伊春市"},
		{"2308","佳木斯市"},
		{"2309","七台河市"},
		{"2310","牡丹江市"},
		{"2311","黑河市"},
		{"2312","绥化市"},
		{"3101","上海市"},
		{"3201","南京市"},
		{"3202","无锡市"},
		{"3203","徐州市"},
		{"3204","常州市"},
		{"3205","苏州市"},
		{"3206","南通市"},
		{"3207","连云港市"},
		{"3208","淮安市"},
		{"3209","盐城市"},
		{"3210","扬州市"},
		{"3211","镇江市"},
		{"3212","泰州市"},
		{"3213","宿迁市"},
		{"3301","杭州市"},
		{"3302","宁波市"},
		{"3303","温州市"},
		{"3304","嘉兴市"},
		{"3305","湖州市"},
		{"3306","绍兴市"},
		{"3307","金华市"},
		{"3308","衢州市"},
		{"3309","舟山市"},
		{"3310","台州市"},
		{"3311","丽水市"},
		{"3401","合肥市"},
		{"3402","芜湖市"},
		{"3403","蚌埠市"},
		{"3404","淮南市"},
		{"3405","马鞍山市"},
		{"3406","淮北市"},
		{"3407","铜陵市"},
		{"3408","安庆市"},
		{"3410","黄山市"},
		{"3411","滁州市"},
		{"3412","阜阳市"},
		{"3413","宿州市"},
		{"3414","巢湖市"},
		{"3415","六安市"},
		{"3416","亳州市"},
		{"3417","池州市"},
		{"3418","宣城市"},
		{"3501","福州市"},
		{"3502","厦门市"},
		{"3503","莆田市"},
		{"3504","三明市"},
		{"3505","泉州市"},
		{"3506","漳州市"},
		{"3507","南平市"},
		{"3508","龙岩市"},
		{"3509","宁德市"},
		{"3601","南昌市"},
		{"3602","景德镇市"},
		{"3603","萍乡市"},
		{"3604","九江市"},
		{"3605","新余市"},
		{"3606","鹰潭市"},
		{"3607","赣州市"},
		{"3608","吉安市"},
		{"3609","宜春市"},
		{"3610","抚州市"},
		{"3611","上饶市"},
		{"3701","济南市"},
		{"3702","青岛市"},
		{"3703","淄博市"},
		{"3704","枣庄市"},
		{"3705","东营市"},
		{"3706","烟台市"},
		{"3707","潍坊市"},
		{"3708","济宁市"},
		{"3709","泰安市"},
		{"3710","威海市"},
		{"3711","日照市"},
		{"3712","莱芜市"},
		{"3713","临沂市"},
		{"3714","德州市"},
		{"3715","聊城市"},
		{"3716","滨州市"},
		{"3717","菏泽市"},
		{"4101","郑州市"},
		{"4102","开封市"},
		{"4103","洛阳市"},
		{"4104","平顶山市"},
		{"4105","安阳市"},
		{"4106","鹤壁市"},
		{"4107","新乡市"},
		{"4108","焦作市"},
		{"4109","濮阳市"},
		{"4110","许昌市"},
		{"4111","漯河市"},
		{"4112","三门峡市"},
		{"4113","南阳市"},
		{"4114","商丘市"},
		{"4115","信阳市"},
		{"4116","周口市"},
		{"4117","驻马店市"},
		{"4201","武汉市"},
		{"4202","黄石市"},
		{"4203","十堰市"},
		{"4205","宜昌市"},
		{"4206","襄樊市"},
		{"4207","鄂州市"},
		{"4208","荆门市"},
		{"4209","孝感市"},
		{"4210","荆州市"},
		{"4211","黄冈市"},
		{"4212","咸宁市"},
		{"4213","随州市"},
		{"4228","恩施土家族苗族自治州"},
		{"4294","省直辖行政单位-仙桃市"},
		{"4295","省直辖行政单位-潜江市"},
		{"4296","省直辖行政单位-天门市"},
		{"429021","省直辖行政单位-神农架林区"},
		{"4301","长沙市"},
		{"4302","株洲市"},
		{"4303","湘潭市"},
		{"4304","衡阳市"},
		{"4305","邵阳市"},
		{"4306","岳阳市"},
		{"4307","常德市"},
		{"4308","张家界市"},
		{"4309","益阳市"},
		{"4310","郴州市"},
		{"4311","永州市"},
		{"4312","怀化市"},
		{"4313","娄底市"},
		{"4331","湘西土家族苗族自治州"},
		{"4401","广州市"},
		{"4402","韶关市"},
		{"4403","深圳市"},
		{"4404","珠海市"},
		{"4405","汕头市"},
		{"4406","佛山市"},
		{"4407","江门市"},
		{"4408","湛江市"},
		{"4409","茂名市"},
		{"4412","肇庆市"},
		{"4413","惠州市"},
		{"4414","梅州市"},
		{"4415","汕尾市"},
		{"4416","河源市"},
		{"4417","阳江市"},
		{"4418","清远市"},
		{"4419","东莞市"},
		{"4420","中山市"},
		{"4451","潮州市"},
		{"4452","揭阳市"},
		{"4453","云浮市"},
		{"4501","南宁市"},
		{"4502","柳州市"},
		{"4503","桂林市"},
		{"4504","梧州市"},
		{"4505","北海市"},
		{"4506","防城港市"},
		{"4507","钦州市"},
		{"4508","贵港市"},
		{"4509","玉林市"},
		{"4510","百色市"},
		{"4511","贺州市"},
		{"4512","河池市"},
		{"4513","来宾市"},
		{"4514","崇左市"},
		{"4601","海口市"},
		{"4602","三亚市"},
		{"4603","省直辖县级行政单位-五指山市"},
		{"4604","省直辖县级行政单位-琼海市"},
		{"4605","省直辖县级行政单位-儋州市"},
		{"4606","省直辖县级行政单位-文昌市"},
		{"4607","省直辖县级行政单位-万宁市"},
		{"4608","省直辖县级行政单位-东方市"},
		{"4609","省直辖县级行政单位-定安县"},
		{"4610","省直辖县级行政单位-屯昌县"},
		{"4611","省直辖县级行政单位-澄迈县"},
		{"4612","省直辖县级行政单位-临高县"},
		{"4613","省直辖县级行政单位-白沙黎族自治县"},
		{"4614","省直辖县级行政单位-昌江黎族自治县"},
		{"4615","省直辖县级行政单位-乐东黎族自治县"},
		{"4616","省直辖县级行政单位-陵水黎族自治县"},
		{"4617","省直辖县级行政单位-保亭黎族苗族自治县"},
		{"4618","省直辖县级行政单位-琼中黎族苗族自治县"},
		{"4619","省直辖县级行政单位-西沙群岛"},
		{"4620","省直辖县级行政单位-南沙群岛"},
		{"4621","省直辖县级行政单位-中沙群岛的岛礁及其海域"},
		{"5001","重庆市"},
		{"5101","成都市"},
		{"5103","自贡市"},
		{"5104","攀枝花市"},
		{"5105","泸州市"},
		{"5106","德阳市"},
		{"5107","绵阳市"},
		{"5108","广元市"},
		{"5109","遂宁市"},
		{"5110","内江市"},
		{"5111","乐山市"},
		{"5113","南充市"},
		{"5114","眉山市"},
		{"5115","宜宾市"},
		{"5116","广安市"},
		{"5117","达州市"},
		{"5118","雅安市"},
		{"5119","巴中市"},
		{"5120","资阳市"},
		{"5132","阿坝藏族羌族自治州"},
		{"5133","甘孜藏族自治州"},
		{"5134","凉山彝族自治州"},
		{"5201","贵阳市"},
		{"5202","六盘水市"},
		{"5203","遵义市"},
		{"5204","安顺市"},
		{"5222","铜仁地区"},
		{"5223","黔西南布依族苗族自治州"},
		{"5224","毕节地区"},
		{"5226","黔东南苗族侗族自治州"},
		{"5227","黔南布依族苗族自治州"},
		{"5301","昆明市"},
		{"5303","曲靖市"},
		{"5304","玉溪市"},
		{"5305","保山市"},
		{"5306","昭通市"},
		{"5307","丽江市"},
		{"5308","思茅市"},
		{"5309","临沧市"},
		{"5323","楚雄彝族自治州"},
		{"5325","红河哈尼族彝族自治州"},
		{"5326","文山壮族苗族自治州"},
		{"5328","西双版纳傣族自治州"},
		{"5329","大理白族自治州"},
		{"5331","德宏傣族景颇族自治州"},
		{"5333","怒江傈僳族自治州"},
		{"5334","迪庆藏族自治州"},
		{"5401","拉萨市"},
		{"5421","昌都地区"},
		{"5422","山南地区"},
		{"5423","日喀则地区"},
		{"5424","那曲地区"},
		{"5425","阿里地区"},
		{"5426","林芝地区"},
		{"6101","西安市"},
		{"6102","铜川市"},
		{"6103","宝鸡市"},
		{"6104","咸阳市"},
		{"6105","渭南市"},
		{"6106","延安市"},
		{"6107","汉中市"},
		{"6108","榆林市"},
		{"6109","安康市"},
		{"6110","商洛市"},
		{"6201","兰州市"},
		{"6202","嘉峪关市"},
		{"6203","金昌市"},
		{"6204","白银市"},
		{"6205","天水市"},
		{"6206","武威市"},
		{"6207","张掖市"},
		{"6208","平凉市"},
		{"6209","酒泉市"},
		{"6210","庆阳市"},
		{"6211","定西市"},
		{"6212","陇南市"},
		{"6229","临夏回族自治州"},
		{"6230","甘南藏族自治州"},
		{"6301","西宁市"},
		{"6321","海东地区"},
		{"6322","海北藏族自治州"},
		{"6323","黄南藏族自治州"},
		{"6325","海南藏族自治州"},
		{"6326","果洛藏族自治州"},
		{"6327","玉树藏族自治州"},
		{"6328","海西蒙古族藏族自治州"},
		{"6401","银川市"},
		{"6402","石嘴山市"},
		{"6403","吴忠市"},
		{"6404","固原市"},
		{"6405","中卫市"},
		{"6501","乌鲁木齐市"},
		{"6502","克拉玛依市"},
		{"6521","吐鲁番地区"},
		{"6522","哈密地区"},
		{"6523","昌吉回族自治州"},
		{"6527","博尔塔拉蒙古自治州"},
		{"6528","巴音郭楞蒙古自治州"},
		{"6529","阿克苏地区"},
		{"6530","克孜勒苏柯尔克孜自治州"},
		{"6531","喀什地区"},
		{"6532","和田地区"},
		{"6540","伊犁哈萨克自治州"},
		{"6542","塔城地区"},
		{"6543","阿勒泰地区"},
		{"6591","省直辖行政单位-石河子市"},
		{"6592","省直辖行政单位-阿拉尔市"},
		{"6593","省直辖行政单位-图木舒克市"},
		{"6594","省直辖行政单位-五家渠市"},
		{"7101","台湾省"},
		{"8101","香港特别行政区"},
		{"8201","澳门特别行政区"}
			};
	
	/**********************
	 23.一般企业财务比率表 evaluation_icommon_ratio_info
	 * *******************/
	public static final String[] EVALUATION_ICOMMON_RATIO_INFO=new String[]{
		"一般企业模型财务比率","营业收入净额(万元)","所有者权益(万元)","模型所有者权益(万元)",
		"贸易经营周期(天)","应收帐款及存货周转率%","营业利润率三年平均值%","净资产收益率%",
		"资本收益率%","资产负债率%","资产负债率三年增加值%","有息债务占资本比例%",
		"短期债务占资本比例%","流动比率(X)","速动比率(X)","EBITDA利息保障倍数(X)",
		"现金流违约距离(X)","杠杆比率(X)","短期债务占总有息债务比率%","EBITDA利润率三年平均值%","资产回报率%","流动性比率%"
	};
	/**********************
	 23.银行财务比率表 evaluation_icommon_ratio_info
	 * *******************/
	public static final String[] EVALUATION_BANK_RATIO_INFO=new String[]{
		"银行模型财务比率","总资产(万元)",
		 "贷款总额(万元)",
		"利息净收入占比%",
		"总资产收益率(减值准备前)%",
		"净资产收益率%",
		"存贷比%",
		"不良贷款率%",
		"拨备覆盖率%",
		"资本充足率%",
		"核心资本充足率%",
		"总资产增长率%",
		"贷款余额增长率%"
	};
	/**
	 * 
	 * @specification 根据编码取名称
	 * @param codeValueInfo 编码名称映射数组
	 * @param code 编码
	 * @return 名称
	 */
	public static String getNameByCode(String[][] codeValueInfo, String code) {
		for(int i=0; i<codeValueInfo.length; i++){
			if(codeValueInfo[i][0].equals(code)){
				return codeValueInfo[i][1];
			}
		}
		return "";
	}
	
	/**
	 * 
	 * @specification 根据名称取编码
	 * @param codeValueInfo 编码名称映射数组
	 * @param name 名称
	 * @return 编码
	 */
	public static String getCodeByName(String[][] codeValueInfo, String name) {
		for(int i=0; i<codeValueInfo.length; i++){
			if(codeValueInfo[i][1].equals(name)){
				return codeValueInfo[i][0];
			}
		}
		return "";
	}
}