﻿/*
页面应用示例:
<head>
<script src="crds_fixed_datasource.js"></script>
</head>
<select name="certification_type">
<option value="" selected>--请选择--</option>
<script>
makeSelectOption(XXXXX,selectedValue);//第二个参数可选
</script>
</select>

说明:XXXXX=下面英文
1.公司类别		downlist_companyType_array
2.公司状态		downlist_companyStatus_array
6.评级公司		downlist_ratingCompany_array
7.评级类型		downlist_ratingType_array
9.是否			downlist_yesno_array
10.公司规模		downlist_size_array
10.1 模型规模      downlist_models_size_array
12.企业类别(担保类型)	downlist_assureType_array
13.国家省份下拉列表	downlist_province_array
14.省-市关联下拉列表	downlist_region_array
15.全球行业代码一级	downlist_globalTradeCodeFirst_array
16.全球行业代码二级	downlist_globalTradeCodeSecond_array
17.全球行业代码三级	downlist_globalTradeCodeThird_array
18.全球行业代码四级	downlist_globalTradeCodeFourth_array
1801.金融非金融类别 downlist_finacialOrNo_array
1803.货币单位	downlist_currencyUnit_array
19.报表涵盖期间 	downlist_reportPeriod_array
20.报表口径		downlist_reportEntity_array
21.报表审计意见   	downlist_reportAudit_array
22.报表质量风险   	downlist_reportRisk_array
23.报表属性		downlist_histForcast_array
24.报表状态		downlist_reportStatus_array
25.评级模型分类	downlist_modelType_array
26.模型行业分类	downlist_modelTradeSort_array
27.抵押品分类		downlist_pawnType_array
28.操作记录		downlist_operationLog_array
29.业务状态	downlist_flow_array
30.角色分类		downlist_roles_array
31.财务比率_非金融一级		downlist_notFinanceFirst_array
32.财务比率_非金融二级		downlist_notFinanceSecond_array
33.数据来源 	downlist_dataSource_array
34.评分表层数 	downlist_TierFinCount
36.电子邮件发送人或抄收人 	downlist_email_R_C(N表示不接收,R表示接收人,C表示抄送人)
36-1.组合管理预警通知设置 combina_earlyWarning_value
36-2.组合管理预警级别    combina_earlyWarning
39.评级支持--集团支持---核心--级别调整规则 	downlist_comp_core_function
40.评级支持--集团支持---重要--级别调整规则 	downlist_comp_import_function
41.评级支持--集团支持---一般--级别调整规则 	downlist_comp_commonly_function
42.评级支持--集团支持---无关--级别调整规则 	downlist_comp_independent_function
43.评级支持--政府支持---完全支持--级别调整规则 	downlist_gov_complete_function
44.评级支持--政府支持---重要支持--级别调整规则 	downlist_gov_import_function
45.评级支持--政府支持---一般支持--级别调整规则 	downlist_gov_commonly_function
46.评级支持--政府支持---无支持--级别调整规则 	  downlist_gov_independent_function
47.债券－计息方式 		downlist_interestType_array
48.债券－交易市场 		downlist_exchange_place_array
48.1.交易市场 			downlist_market_array
49.债券－优先/次级 downlist_debt_level_array
50.债券池        downlist_bond_pool_array
51.评级模板－严重性 downlist_index_effect_array
52.评级模板－下调评级数目  downlist_pdown_rating_array
53.任务类别  downlist_task_type_array
54.财务比率_金融一级银行	downlist_notBankFirst_array
55.财务比率_金融二级银行	downlist_notBankSecond_array
56.财务比率_金融一级证券   downlist_notSecuritFirst_array
57.财务比率_金融二级证券	downlist_notSecuritSecond_array
58.财务比率_金融一级保险	downlist_notInsuranceFirst_array
59.财务比率_金融二级保险	downlist_notInsuranceSecond_array
60.财务比率_金融二级银行Show	downlist_notBankSecondShow_array
61.财务比率_金融二级证券Show	downlist_notSecuritSecondShow_array
62.财务比率_金融二级保险Show	downlist_notInsuranceSecondShow_array
63.财务比率_金融二级置空   downlist_selectShow_array
64 异常诊断模版类型        downlist_exception_index_type_array
65.异常诊断-财务比率_非金融一级		downlist_exception_notFinanceFirst_array
66.异常诊断-财务比率_非金融二级		downlist_exception_notFinanceSecond_array
68 债券期限 downlist_bond_term
69.财务比率_同业比较 downlist_comparision_array
70.公司性质 downlist_companyProperty_array
71.抵押品一级分类　downlist_pawnOne_array
72.抵押品二级分类  downlist_pawnTwo_array
73.是EL%/UL%/平均二级市场利差  downlist_ulelma_array
74.是否同意  downlist_agreePass_array
75.手工调整  downlist_manual_array
77.系统控制类型 downlist_control_type
80.公司责任类型 downlist_company_dutyType_array
81.公司经营地区 downlist_company_business_region_array
82.身份证所属地区  downlist_IDCard_region_array
83.教育程度  downlist_education_array
84.婚姻状况  downlist_marriage_status_array
85.住宅所有权  downlist_tenement_ownership_array
86.是否拥有海外物业或资产  downlist_midsea_materials_array
87.是否提供收入来源证明  downlist_revenue_origin_prove_array
88.过去三年之负面资信记录  downlist_downside_standing_array
89.授信类别  downlist_credit_type_array
90.审批结论  downlist_approval_conclusion_array
91.小企业指标类别一级  downlist_small_icommonCategoryFirst_array
92.小企业指标类别二级  downlist_small_icommonCategorySecond_array
94.过去12个月透支户有否不正常的往来情况 downlist_overdrawing_account
95.过去12个月信贷记录 downlist_financial_credit
96.帮助行业信息类型列表 downlist_help_industry_info_type
97.状态列表 downlist_status_array
98.财务比率_政府的事业单位一级	downlist_SY_First_array
99.财务比率_政府的事业单位二级	downlist_SY_Second_array
100.财务比率_政府一级	downlist_ZF_First_array
101.财务比率_政府二级	downlist_ZF_Second_array
102.财务比率_多边发展银行一级	downlist_DB_First_array
103.财务比率_多边发展银行二级	downlist_DB_Second_array
104.集团成员    downlist_group_array
105.成员关系    downlist_relationship_array
106.文档管理-文件类型    downlist_file_type_array
*
/***********************
1.公司类别
***********************/
var downlist_companyType_array=new Array(
	["ET","一般企业"],
	["BT","银行"],
	["ST","证券"],
	["IT","保险"]
);
var downlist_companyType_array_assure=new Array(
	["ET","一般企业"],
	["BT","银行"],
	["ST","证券"],
	["IT","保险"],
	["ZF","政府"],
	["DB","多边发展银行"],
	["SY","等同于政府的事业单位"]
);
/*****************************
2.公司状态
*****************************/
var downlist_companyStatus_array=new Array(
	["N","正常"],
	["D","违约"],
	["S","结清"],
	["C","核销"]
);
/*****************************
6.评级公司
*****************************/
var downlist_ratingCompany_array=new Array(
	["NA","请选择"],
	["moody_rating","穆迪"],
	["standard_rating","标准普尔"],
	["bra_rating","内部评级"]
);
/*****************************
7.评级类型
*****************************/
var downlist_ratingType_array=new Array(
	["T1","发行人评级"],
	["T2","长期债项评级"],
	["T3","短期债项评级"]
);
/*****************************
9.是否
*****************************/
var downlist_yesno_array=new Array(
	["N","否"],
	["Y","是"]
);
/*****************************
10.公司规模
*****************************/
var downlist_size_array=new Array(
	["BS","大型"],
	["MS","中型"],
	["SS","小型"]
);
/*****************************
10.1 模型规模
*****************************/
var downlist_models_size_array=new Array(
	["BS","大型"],
	["MS","中型"],
	["SS","小型"],
	["BM","大中"],
	["MX","中小"],
	["AS","全部"]
);
/*****************************
12.企业类别(担保类型)
*****************************/
var downlist_assureType_array=new Array(
	["QY","企业"],
	["YH","商业银行"],
	["BX","保险公司"],
	["ZQ","证券公司"],
	["SY","等同于政府的事业单位"],
	["ZF","政府"],
	["DB","多边发展银行"],
	["GR","个人"]
);
/*****************************
13.国家省份下拉列表          
*****************************/
var  downlist_province_array=new Array(
					   ["0000","全国"],
					   ["1100","北京市"],
				       ["1200","天津市"],
				       ["1300","河北省"],
				       ["1400","山西省"],
				       ["1500","内蒙古自治区"],
				       ["2100","辽宁省"],
				       ["2200","吉林省"],
				       ["2300","黑龙江省"],
				       ["3100","上海市"],
				       ["3200","江苏省"],
				       ["3300","浙江省"],
				       ["3400","安徽省"],
				       ["3500","福建省"],
				       ["3600","江西省"],
				       ["3700","山东省"],
				       ["4100","河南省"],
				       ["4200","湖北省"],
				       ["4300","湖南省"],
				       ["4400","广东省"],
				       ["4500","广西壮族自治区"],
				       ["4600","海南省"],
				       ["5500","重庆市"],
				       ["5100","四川省"],
				       ["5200","贵州省"],
				       ["5300","云南省"],
				       ["5400","西藏自治区"],
				       ["6100","陕西省"],
				       ["6200","甘肃省"],
				       ["6300","青海省"],	
				       ["6400","宁夏回族自治区"],
				       ["6500","新疆维吾尔自治区"],
				       ["7100","香港"],
				       ["7200","澳门"],
				       ["7300","台湾"],
				       ["9900","其他"]
				       );	

/***********************
14.省-市关联下拉列表
***********************/
var  downlist_region_array =  new Array(
						["0000","全国","0001","全国"],
						["1100","北京市","1101","北京市"],
						["1200","天津市","1201","天津市"],
						["1300","河北省","1301","石家庄市"],
						["1300","河北省","1302","唐山市"],
						["1300","河北省","1303","秦皇岛市"],
						["1300","河北省","1304","邯郸市"],
						["1300","河北省","1305","邢台市"],
						["1300","河北省","1306","保定市"],
						["1300","河北省","1307","张家口市"],
						["1300","河北省","1308","承德市"],
						["1300","河北省","1309","沧州市"],
						["1300","河北省","1310","廊坊市"],
						["1300","河北省","1311","衡水市"],
						["1400","山西省","1401","太原市"],
						["1400","山西省","1402","大同市"],
						["1400","山西省","1403","阳泉市"],
						["1400","山西省","1404","长治市"],
						["1400","山西省","1405","晋城市"],
						["1400","山西省","1406","朔州市"],
						["1400","山西省","1407","晋中市"],
						["1400","山西省","1408","运城市"],
						["1400","山西省","1409","忻州市"],
						["1400","山西省","1410","临汾市"],
						["1400","山西省","1411","吕梁市"],
						["1500","内蒙古自治区","1501","呼和浩特市"],
						["1500","内蒙古自治区","1502","包头市"],
						["1500","内蒙古自治区","1503","乌海市"],
						["1500","内蒙古自治区","1504","赤峰市"],
						["1500","内蒙古自治区","1505","通辽市"],
						["1500","内蒙古自治区","1506","鄂尔多斯市"],
						["1500","内蒙古自治区","1507","呼伦贝尔市"],
						["1500","内蒙古自治区","1508","巴彦淖尔市"],
						["1500","内蒙古自治区","1509","乌兰察布市"],
						["1500","内蒙古自治区","1522","兴安盟"],
						["1500","内蒙古自治区","1525","锡林郭勒盟"],
						["1500","内蒙古自治区","1529","阿拉善盟"],
						["2100","辽宁省","2101","沈阳市"],
						["2100","辽宁省","2102","大连市"],
						["2100","辽宁省","2103","鞍山市"],
						["2100","辽宁省","2104","抚顺市"],
						["2100","辽宁省","2105","本溪市"],
						["2100","辽宁省","2106","丹东市"],
						["2100","辽宁省","2107","锦州市"],
						["2100","辽宁省","2108","营口市"],
						["2100","辽宁省","2109","阜新市"],
						["2100","辽宁省","2110","辽阳市"],
						["2100","辽宁省","2111","盘锦市"],
						["2100","辽宁省","2112","铁岭市"],
						["2100","辽宁省","2113","朝阳市"],
						["2100","辽宁省","2114","葫芦岛市"],
						["2200","吉林省","2201","长春市"],
						["2200","吉林省","2202","吉林市"],
						["2200","吉林省","2203","四平市"],
						["2200","吉林省","2204","辽源市"],
						["2200","吉林省","2205","通化市"],
						["2200","吉林省","2206","白山市"],
						["2200","吉林省","2207","松原市"],
						["2200","吉林省","2208","白城市"],
						["2200","吉林省","2224","延边朝鲜族自治州"],
						["2300","黑龙江省","2301","哈尔滨市"],
						["2300","黑龙江省","2302","齐齐哈尔市"],
						["2300","黑龙江省","2303","鸡西市"],
						["2300","黑龙江省","2304","鹤岗市"],
						["2300","黑龙江省","2305","双鸭山市"],
						["2300","黑龙江省","2306","大庆市"],
						["2300","黑龙江省","2307","伊春市"],
						["2300","黑龙江省","2308","佳木斯市"],
						["2300","黑龙江省","2309","七台河市"],
						["2300","黑龙江省","2310","牡丹江市"],
						["2300","黑龙江省","2311","黑河市"],
						["2300","黑龙江省","2312","绥化市"],
						["3100","上海市","3101","上海市"],
						["3200","江苏省","3201","南京市"],
						["3200","江苏省","3202","无锡市"],
						["3200","江苏省","3203","徐州市"],
						["3200","江苏省","3204","常州市"],
						["3200","江苏省","3205","苏州市"],
						["3200","江苏省","3206","南通市"],
						["3200","江苏省","3207","连云港市"],
						["3200","江苏省","3208","淮安市"],
						["3200","江苏省","3209","盐城市"],
						["3200","江苏省","3210","扬州市"],
						["3200","江苏省","3211","镇江市"],
						["3200","江苏省","3212","泰州市"],
						["3200","江苏省","3213","宿迁市"],
						["3300","浙江省","3301","杭州市"],
						["3300","浙江省","3302","宁波市"],
						["3300","浙江省","3303","温州市"],
						["3300","浙江省","3304","嘉兴市"],
						["3300","浙江省","3305","湖州市"],
						["3300","浙江省","3306","绍兴市"],
						["3300","浙江省","3307","金华市"],
						["3300","浙江省","3308","衢州市"],
						["3300","浙江省","3309","舟山市"],
						["3300","浙江省","3310","台州市"],
						["3300","浙江省","3311","丽水市"],
						["3400","安徽省","3401","合肥市"],
						["3400","安徽省","3402","芜湖市"],
						["3400","安徽省","3403","蚌埠市"],
						["3400","安徽省","3404","淮南市"],
						["3400","安徽省","3405","马鞍山市"],
						["3400","安徽省","3406","淮北市"],
						["3400","安徽省","3407","铜陵市"],
						["3400","安徽省","3408","安庆市"],
						["3400","安徽省","3410","黄山市"],
						["3400","安徽省","3411","滁州市"],
						["3400","安徽省","3412","阜阳市"],
						["3400","安徽省","3413","宿州市"],
						["3400","安徽省","3414","巢湖市"],
						["3400","安徽省","3415","六安市"],
						["3400","安徽省","3416","亳州市"],
						["3400","安徽省","3417","池州市"],
						["3400","安徽省","3418","宣城市"],
						["3500","福建省","3501","福州市"],
						["3500","福建省","3502","厦门市"],
						["3500","福建省","3503","莆田市"],
						["3500","福建省","3504","三明市"],
						["3500","福建省","3505","泉州市"],
						["3500","福建省","3506","漳州市"],
						["3500","福建省","3507","南平市"],
						["3500","福建省","3508","龙岩市"],
						["3500","福建省","3509","宁德市"],
						["3600","江西省","3601","南昌市"],
						["3600","江西省","3602","景德镇市"],
						["3600","江西省","3603","萍乡市"],
						["3600","江西省","3604","九江市"],
						["3600","江西省","3605","新余市"],
						["3600","江西省","3606","鹰潭市"],
						["3600","江西省","3607","赣州市"],
						["3600","江西省","3608","吉安市"],
						["3600","江西省","3609","宜春市"],
						["3600","江西省","3610","抚州市"],
						["3600","江西省","3611","上饶市"],
						["3700","山东省","3701","济南市"],
						["3700","山东省","3702","青岛市"],
						["3700","山东省","3703","淄博市"],
						["3700","山东省","3704","枣庄市"],
						["3700","山东省","3705","东营市"],
						["3700","山东省","3706","烟台市"],
						["3700","山东省","3707","潍坊市"],
						["3700","山东省","3708","济宁市"],
						["3700","山东省","3709","泰安市"],
						["3700","山东省","3710","威海市"],
						["3700","山东省","3711","日照市"],
						["3700","山东省","3712","莱芜市"],
						["3700","山东省","3713","临沂市"],
						["3700","山东省","3714","德州市"],
						["3700","山东省","3715","聊城市"],
						["3700","山东省","3716","滨州市"],
						["3700","山东省","3717","菏泽市"],
						["4100","河南省","4101","郑州市"],
						["4100","河南省","4102","开封市"],
						["4100","河南省","4103","洛阳市"],
						["4100","河南省","4104","平顶山市"],
						["4100","河南省","4105","安阳市"],
						["4100","河南省","4106","鹤壁市"],
						["4100","河南省","4107","新乡市"],
						["4100","河南省","4108","焦作市"],
						["4100","河南省","4109","濮阳市"],
						["4100","河南省","4110","许昌市"],
						["4100","河南省","4111","漯河市"],
						["4100","河南省","4112","三门峡市"],
						["4100","河南省","4113","南阳市"],
						["4100","河南省","4114","商丘市"],
						["4100","河南省","4115","信阳市"],
						["4100","河南省","4116","周口市"],
						["4100","河南省","4117","驻马店市"],
						["4200","湖北省","4201","武汉市"],
						["4200","湖北省","4202","黄石市"],
						["4200","湖北省","4203","十堰市"],
						["4200","湖北省","4205","宜昌市"],
						["4200","湖北省","4206","襄樊市"],
						["4200","湖北省","4207","鄂州市"],
						["4200","湖北省","4208","荆门市"],
						["4200","湖北省","4209","孝感市"],
						["4200","湖北省","4210","荆州市"],
						["4200","湖北省","4211","黄冈市"],
						["4200","湖北省","4212","咸宁市"],
						["4200","湖北省","4213","随州市"],
						["4200","湖北省","4228","恩施土家族苗族自治州"],
						["4200","湖北省","4294","省直辖行政单位-仙桃市"],
						["4200","湖北省","4295","省直辖行政单位-潜江市"],
						["4200","湖北省","4296","省直辖行政单位-天门市"],
						["4200","湖北省","429021","省直辖行政单位-神农架林区"],
						["4300","湖南省","4301","长沙市"],
						["4300","湖南省","4302","株洲市"],
						["4300","湖南省","4303","湘潭市"],
						["4300","湖南省","4304","衡阳市"],
						["4300","湖南省","4305","邵阳市"],
						["4300","湖南省","4306","岳阳市"],
						["4300","湖南省","4307","常德市"],
						["4300","湖南省","4308","张家界市"],
						["4300","湖南省","4309","益阳市"],
						["4300","湖南省","4310","郴州市"],
						["4300","湖南省","4311","永州市"],
						["4300","湖南省","4312","怀化市"],
						["4300","湖南省","4313","娄底市"],
						["4300","湖南省","4331","湘西土家族苗族自治州"],
						["4400","广东省","4401","广州市"],
						["4400","广东省","4402","韶关市"],
						["4400","广东省","4410","深圳市"],
						["4400","广东省","4404","珠海市"],
						["4400","广东省","4405","汕头市"],
						["4400","广东省","4406","佛山市"],
						["4400","广东省","4407","江门市"],
						["4400","广东省","4408","湛江市"],
						["4400","广东省","4409","茂名市"],
						["4400","广东省","4412","肇庆市"],
						["4400","广东省","4413","惠州市"],
						["4400","广东省","4414","梅州市"],
						["4400","广东省","4415","汕尾市"],
						["4400","广东省","4416","河源市"],
						["4400","广东省","4417","阳江市"],
						["4400","广东省","4418","清远市"],
						["4400","广东省","4419","东莞市"],
						["4400","广东省","4420","中山市"],
						["4400","广东省","4451","潮州市"],
						["4400","广东省","4452","揭阳市"],
						["4400","广东省","4453","云浮市"],
						["4500","广西壮族自治区","4501","南宁市"],
						["4500","广西壮族自治区","4502","柳州市"],
						["4500","广西壮族自治区","4503","桂林市"],
						["4500","广西壮族自治区","4504","梧州市"],
						["4500","广西壮族自治区","4505","北海市"],
						["4500","广西壮族自治区","4506","防城港市"],
						["4500","广西壮族自治区","4507","钦州市"],
						["4500","广西壮族自治区","4508","贵港市"],
						["4500","广西壮族自治区","4509","玉林市"],
						["4500","广西壮族自治区","4510","百色市"],
						["4500","广西壮族自治区","4511","贺州市"],
						["4500","广西壮族自治区","4512","河池市"],
						["4500","广西壮族自治区","4513","来宾市"],
						["4500","广西壮族自治区","4514","崇左市"],
						["4600","海南省","4601","海口市"],
						["4600","海南省","4602","三亚市"],
						["4600","海南省","4603","县级行政单位-五指山市"],
						["4600","海南省","4604","县级行政单位-琼海市"],
						["4600","海南省","4605","县级行政单位-儋州市"],
						["4600","海南省","4606","县级行政单位-文昌市"],
						["4600","海南省","4607","县级行政单位-万宁市"],
						["4600","海南省","4608","县级行政单位-东方市"],
						["4600","海南省","4609","县级行政单位-定安县"],
						["4600","海南省","4610","县级行政单位-屯昌县"],
						["4600","海南省","4611","县级行政单位-澄迈县"],
						["4600","海南省","4612","县级行政单位-临高县"],
						["4600","海南省","4613","县级行政单位-白沙黎族自治县"],
						["4600","海南省","4614","县级行政单位-昌江黎族自治县"],
						["4600","海南省","4615","县级行政单位-乐东黎族自治县"],
						["4600","海南省","4616","县级行政单位-陵水黎族自治县"],
						["4600","海南省","4617","县级行政单位-保亭黎族苗族自治县"],
						["4600","海南省","4618","县级行政单位-琼中黎族苗族自治县"],
						["4600","海南省","4619","县级行政单位-西沙群岛"],
						["4600","海南省","4620","县级行政单位-南沙群岛"],
						["4600","海南省","4621","县级行政单位-中沙群岛岛礁及海域"],
						["5500","重庆市","5501","重庆市"],
						["5100","四川省","5101","成都市"],
						["5100","四川省","5103","自贡市"],
						["5100","四川省","5104","攀枝花市"],
						["5100","四川省","5105","泸州市"],
						["5100","四川省","5106","德阳市"],
						["5100","四川省","5107","绵阳市"],
						["5100","四川省","5108","广元市"],
						["5100","四川省","5109","遂宁市"],
						["5100","四川省","5110","内江市"],
						["5100","四川省","5111","乐山市"],
						["5100","四川省","5113","南充市"],
						["5100","四川省","5114","眉山市"],
						["5100","四川省","5115","宜宾市"],
						["5100","四川省","5116","广安市"],
						["5100","四川省","5117","达州市"],
						["5100","四川省","5118","雅安市"],
						["5100","四川省","5119","巴中市"],
						["5100","四川省","5120","资阳市"],
						["5100","四川省","5132","阿坝藏族羌族自治州"],
						["5100","四川省","5133","甘孜藏族自治州"],
						["5100","四川省","5134","凉山彝族自治州"],
						["5200","贵州省","5201","贵阳市"],
						["5200","贵州省","5202","六盘水市"],
						["5200","贵州省","5203","遵义市"],
						["5200","贵州省","5204","安顺市"],
						["5200","贵州省","5222","铜仁地区"],
						["5200","贵州省","5223","黔西南布依族苗族自治州"],
						["5200","贵州省","5224","毕节地区"],
						["5200","贵州省","5226","黔东南苗族侗族自治州"],
						["5200","贵州省","5227","黔南布依族苗族自治州"],
						["5300","云南省","5301","昆明市"],
						["5300","云南省","5303","曲靖市"],
						["5300","云南省","5304","玉溪市"],
						["5300","云南省","5305","保山市"],
						["5300","云南省","5306","昭通市"],
						["5300","云南省","5307","丽江市"],
						["5300","云南省","5308","思茅市"],
						["5300","云南省","5309","临沧市"],
						["5300","云南省","5323","楚雄彝族自治州"],
						["5300","云南省","5325","红河哈尼族彝族自治州"],
						["5300","云南省","5326","文山壮族苗族自治州"],
						["5300","云南省","5328","西双版纳傣族自治州"],
						["5300","云南省","5329","大理白族自治州"],
						["5300","云南省","5331","德宏傣族景颇族自治州"],
						["5300","云南省","5333","怒江傈僳族自治州"],
						["5300","云南省","5334","迪庆藏族自治州"],
						["5400","西藏自治区","5401","拉萨市"],
						["5400","西藏自治区","5421","昌都地区"],
						["5400","西藏自治区","5422","山南地区"],
						["5400","西藏自治区","5423","日喀则地区"],
						["5400","西藏自治区","5424","那曲地区"],
						["5400","西藏自治区","5425","阿里地区"],
						["5400","西藏自治区","5426","林芝地区"],
						["6100","陕西省","6101","西安市"],
						["6100","陕西省","6102","铜川市"],
						["6100","陕西省","6103","宝鸡市"],
						["6100","陕西省","6104","咸阳市"],
						["6100","陕西省","6105","渭南市"],
						["6100","陕西省","6106","延安市"],
						["6100","陕西省","6107","汉中市"],
						["6100","陕西省","6108","榆林市"],
						["6100","陕西省","6109","安康市"],
						["6100","陕西省","6110","商洛市"],
						["6200","甘肃省","6201","兰州市"],
						["6200","甘肃省","6202","嘉峪关市"],
						["6200","甘肃省","6203","金昌市"],
						["6200","甘肃省","6204","白银市"],
						["6200","甘肃省","6205","天水市"],
						["6200","甘肃省","6206","武威市"],
						["6200","甘肃省","6207","张掖市"],
						["6200","甘肃省","6208","平凉市"],
						["6200","甘肃省","6209","酒泉市"],
						["6200","甘肃省","6210","庆阳市"],
						["6200","甘肃省","6211","定西市"],
						["6200","甘肃省","6212","陇南市"],
						["6200","甘肃省","6229","临夏回族自治州"],
						["6200","甘肃省","6230","甘南藏族自治州"],
						["6300","青海省","6301","西宁市"],
						["6300","青海省","6321","海东地区"],
						["6300","青海省","6322","海北藏族自治州"],
						["6300","青海省","6323","黄南藏族自治州"],
						["6300","青海省","6325","海南藏族自治州"],
						["6300","青海省","6326","果洛藏族自治州"],
						["6300","青海省","6327","玉树藏族自治州"],
						["6300","青海省","6328","海西蒙古族藏族自治州"],
						["6400","宁夏回族自治区","6401","银川市"],
						["6400","宁夏回族自治区","6402","石嘴山市"],
						["6400","宁夏回族自治区","6403","吴忠市"],
						["6400","宁夏回族自治区","6404","固原市"],
						["6400","宁夏回族自治区","6405","中卫市"],
						["6500","新疆维吾尔自治区","6501","乌鲁木齐市"],
						["6500","新疆维吾尔自治区","6502","克拉玛依市"],
						["6500","新疆维吾尔自治区","6521","吐鲁番地区"],
						["6500","新疆维吾尔自治区","6522","哈密地区"],
						["6500","新疆维吾尔自治区","6523","昌吉回族自治州"],
						["6500","新疆维吾尔自治区","6527","博尔塔拉蒙古自治州"],
						["6500","新疆维吾尔自治区","6528","巴音郭楞蒙古自治州"],
						["6500","新疆维吾尔自治区","6529","阿克苏地区"],
						["6500","新疆维吾尔自治区","6530","克孜勒苏柯尔克孜自治州"],
						["6500","新疆维吾尔自治区","6531","喀什地区"],
						["6500","新疆维吾尔自治区","6532","和田地区"],
						["6500","新疆维吾尔自治区","6540","伊犁哈萨克自治州"],
						["6500","新疆维吾尔自治区","6542","塔城地区"],
						["6500","新疆维吾尔自治区","6543","阿勒泰地区"],
						["6500","新疆维吾尔自治区","6591","省直辖行政单位-石河子市"],
						["6500","新疆维吾尔自治区","6592","省直辖行政单位-阿拉尔市"],
						["6500","新疆维吾尔自治区","6593","省直辖行政单位-图木舒克市"],
						["6500","新疆维吾尔自治区","6594","省直辖行政单位-五家渠市"],
						["7100","香港","7101","香港"],
						["7200","澳门","7201","澳门"],
						["7300","台湾","7301","台湾"],
						["9900","其他","9901","境外"],
						["9900","其他","9902","其他"]);
/***********************
15.全球行业代码一级
***********************/
var downlist_globalTradeCodeFirst_array=new Array(
	["10000000","能源"],
	["15000000","原材料"],
	["20000000","工业"],
	["25000000","消费者相机选购品"],
	["30000000","日常消费品"],
	["35000000","医疗保健"],
	["40000000","金融"],
	["45000000","信息科技"],
	["50000000","电信业务"],
	["55000000","公用事业"]);
/***********************
16.全球行业代码二级
***********************/
var downlist_globalTradeCodeSecond_array=new Array(
	["1010","能源"],
	["1510","原材料"],
	["2010","资本货物"],
	["2020","商业服务与供应品"],
	["2030","运输"],
	["2510","汽车与汽车零部件"],
	["2520","耐用消费品与服装"],
	["2530","消费者服务"],
	["2540","媒体"],
	["2550","零售业"],
	["3010","食品与主要用品零售"],
	["3020","食品、饮料与烟草"],
	["3030","家庭与个人用品"],
	["3510","医疗保健设备与服务"],
	["3520","制药与生物科技"],
	["4010","银行"],
	["4020","综合金融"],
	["4030","保险"],
	["4040","房地产"],
	["4510","软件与服务"],
	["4520","技术硬件与设备"],
	["4530","半导体与半导体生产设备"],
	["5010","电信业务"],
	["5510","公用事业"]
);
/***********************
17.全球行业代码三级
***********************/
var downlist_globalTradeCodeThird_array=new Array(
	["101010","能源设备与服务"],
	["101020","石油、天然气与供消费用燃料"],
	["151010","化学制品"],
	["151020","建筑材料"],
	["151030","容器与包装"],
	["151040","金属与采矿"],
	["151050","纸产品与林产品"],
	["201010","航空航天与国防"],
	["201020","建筑产品"],
	["201030","建筑与工程"],
	["201040","电气设备"],
	["201050","工业集团企业"],
	["201060","机械制造"],
	["201070","贸易公司与经销商"],
	["202010","商业服务与供应品"],
	["203010","航空货运与物流"],
	["203020","航空公司"],
	["203030","海运"],
	["203040","公路与铁路"],
	["203050","交通基本设施"],
	["251010","汽车零配件"],
	["251020","汽车"],
	["252010","家庭耐用消费品"],
	["252020","休闲设备与用品"],
	["252030","纺织品、服装与奢侈品"],
	["253010","酒店、餐馆与休闲"],
	["253020","综合消费者服务"],
	["254010","媒体"],
	["255010","经销商"],
	["255020","互联网与售货目录零售"],
	["255030","多元化零售"],
	["255040","专营零售"],
	["301010","食品与主要用品零售"],
	["302010","饮料"],
	["302020","食品"],
	["302030","烟草"],
	["303010","家常用品"],
	["303020","个人用品"],
	["351010","医疗保健设备与用品"],
	["351020","医疗保健提供商与服务"],
	["352010","生物科技"],
	["352020","制药"],
	["401010","商业银行"],
	["401020","互助储蓄银行与抵押信贷"],
	["402010","综合金融服务"],
	["402020","消费信贷"],
	["402030","资本市场"],
	["403010","保险"],
	["404010","房地产"],
	["451010","互联网软件与服务"],
	["451020","信息科技服务"],
	["451030","软件"],
	["452010","通信设备"],
	["452020","电脑与外围设备"],
	["452030","电子设备与仪器"],
	["452040","办公电子设备"],
	["452050","半导体设备与产品"],
	["453010","半导体产品与半导体设备"],
	["501010","综合电信业务"],
	["501020","无线电信业务"],
	["551010","电力公用事业"],
	["551020","燃气公用事业"],
	["551030","复合型公用事业"],
	["551040","水公用事业"],
	["551050","独立电力生产商与能源贸易商"]
);
/***********************
18.全球行业代码四级
***********************/
var downlist_globalTradeCodeFourth_array=new Array(
	["N01","正常"],
	["D01","违约"],
	["S01","结清"],
	["C01","核销"]
);
/***********************
1801.金融非金融类型
***********************/
var downlist_finacialOrNo_array=new Array(
	["F","金融"],
	["NF","非金融"]
);
/***********************
1803.货币单位
***********************/
var downlist_currencyUnit_array=new Array(
	["YUAN","元"],
	["KYUAN","千元"],
	["TKYUAN","万元"],
	["HMYUAN","百万元"],
	["BYUAN","亿元"]
);
/***********************
19.报表涵盖期间
***********************/
var downlist_reportPeriod_array=new Array(
	["03","3个月"],
	["06","6个月"],
	["09","9个月"],
	["12","12个月"]
);
/***********************
20.报表口径
***********************/
var downlist_reportEntity_array=new Array(
	["11","集团合并"],
	["21","集团本部"],
	["03","非集团"],
	["04","集团合并(不完整信息)"]
);
/***********************
21.报表审计意见
***********************/
var downlist_reportAudit_array=new Array(
	["NA","未审计"],
	["A1","无保留意见"],
	["A2","保留意见"],
	["A3","标准无保留意见"],
	["A4","否定意见"],
	["A5","无法表达意见"]
);
/***********************
22.报表质量风险
***********************/
var downlist_reportRisk_array=new Array(
	["FQR1","财务信息质量最高，信息失真的可能性很小"],
	["FQR2","财务信息质量较高，信息失真的可能性较小"],
	["FQR3","财务信息质量中等，信息失真的可能性中等"],
	["FQR4","财务信息质量较差，信息失真的可能性较大"],
	["FQR5","财务信息质量很差，信息失真的可能性很大"]
);
/***********************
23.报表属性
***********************/
var downlist_histForcast_array=new Array(
	["HR","历史报表"],
	["FRPE","悲观预测"],
	["FROP","乐观预测"],
	["FRAV","平均预测"],
	["SA","情景分析"]
);
/***********************
24.报表状态
***********************/
var downlist_reportStatus_array=new Array(
	["SA","保存"],
	["TS","暂存"]
);
/***********************
25.模型行业分类
***********************/
var downlist_modelTradeSort_array=new Array(
	["MI01","农林牧渔业"],
	["MI02","采矿业"],
	["MI03","资本货物制造"],
	["MI04","耐用品制造"],
	["MI05","消费品制造"],
	["MI06","批发及贸易"],
	["MI07","零售业"],
	["MI08","建筑业"],
	["MI09","运输业"],
	["MI10","信息技术"],
	["MI11","商业服务"],
	["MI12","个人服务"],
	["MI13","公用事业"],
	["MI14","投资控股及企业集团"],
	["MI15","银行"],
	["MI16","投资银行"],
	["MI17","保险业"],
	["MI18","房地产业"]
);
/***********************
26.评级模型分类
***********************/
var downlist_modelType_array=new Array(
	["ME","企业模型"],
	["MB","银行模型"],
	["MA","投资银行模型"],
	["MI","保险公司模型"],
	["MH","房地产模型"]
);
/***********************
27.抵押品分类名称
***********************/
var downlist_pawnType_array=new Array(
	["COL0100","存款单证"],
	["COL0101","人民币存单"],
	["COL0102","保本结构性存款证(人民币)"],
	["COL0103","人民币现金"],
	["COL0104","外币存单"],
	["COL0105","外币现汇"],
	["COL0200","贵金属"],
	["COL0201","黄金"],
	["COL0202","除黄金外贵金属"],
	["COL0300","股票"],
	["COL0301","沪深港主板成分指数样本股"],
	["COL0302","沪深港非成份指数样本股"],
	["COL0303","不通过交易所流通的公司股权"],
	["COL0400","债券"],
	["COL0401","中国政府和人民银行债券/票据"],
	["COL0402","外国政府、中央银行及风险权重为0的多边开发银行发行债券"],
	["COL0403","可在交易所交易的金融债券"],
	["COL0404","不可在交易所交易的金融债券"],
	["COL0405","可在交易所交易的企业/公司债券"],
	["COL0406","不可在交易所交易的企业/公司债券"],
	["COL0500","基金"],
	["COL0501","仅投资于政府债券的公募基金"],
	["COL0502","可投资于各类债券的公募基金"],
	["COL0503","仅投资于主板成份指数样本股的公募基金"],
	["COL0504","可投资于各类在交易所公开交易股票的公募基金"],
	["COL0505","其他基金"],
	["COL0600","票据"],
	["COL0601","商业承兑汇票，原始期限小于1年"],
	["COL0602","商业承兑汇票，原始期限大于1年"],
	["COL0603","银行承兑汇票，原始期限小于1年"],
	["COL0604","银行承兑汇票，原始期限大于1年"],
	["COL0605","银行本票/银行汇票，期限小于1年"],
	["COL0606","银行本票/银行汇票，期限大于1年"],
	["COL0700","权利"],
	["COL0701","公路桥梁、公路隧道、公路渡口收费权"],
	["COL0702","农村电网建设与改造工程电费收费权"],
	["COL0703","其他收费权"],
	["COL0704","国外注册保险公司保单?"],
	["COL0705","我国保险公司保单"],
	["COL0706","其他权利"],
	["COL0800","房产和土地"],
	["COL0801","商业营业用房"],
	["COL0802","办公楼"],
	["COL0803","厂房"],
	["COL0804","普通住宅"],
	["COL0805","别墅及高档公寓"],
	["COL0806","划拨的土地使用权"],
	["COL0807","出让的土地使用权"],
	["COL0900","设备"],
	["COL0901","通用机器设备"],
	["COL0902","非通用机器设备"],
	["COL0903","营运车辆"],
	["COL0904","商务车"],
	["COL0905","家用车"],
	["COL0906","其它交通运输工具"],
	["COL0907","其他财产"]
);
/***********************
28.操作记录
***********************/
var downlist_operationLog_array=new Array(
	["DB","删除基本信息"],
	["MB","基本信息变化"],
	["MF","财务信息变化"],
	["MD","债项信息变化"],
	["MP","抵押信息变化"],
	["MA","担保信息变化"]
);
/***********************
29. 业务状态
***********************/
var downlist_flow_array=new Array(
	["RH","历史评级"],
	["RV","当前有效"],
	["NR","未评级"],
	["SA","暂存"],
	["CO","审批中"],
	["RT","退回"],
	["RC","评级重检"]
);
/***********************
30.角色分类downlist_roles_array [角色ID,角色名称]
***********************/
var downlist_roles_array=new Array(
	["R00","分析师(客户经理)"],	//始终参与流程(配置文件p_pub_spring.xml systype: B-客户经理 F-分析师)
	["R01","基金经理"],			//始终不参与流程
	["R02","部门经理"],			//始终不参与流程
	["R03","风险经理"],			//始终不参与流程
	["R04","信息录入员"],		//始终不参与流程
	["R05","任务分配人"],		//始终参与流程
	["R06","信息监察员"],		//始终不参与流程
	["R07","日常维护员"],		//始终不参与流程
	["R08","交易员"],			//始终不参与流程
	["R09","研究员"],			//始终不参与流程
	["R10","业务管理"]		//始终不参与流程
);
/***********************
31.财务比率_非金融一级	一般企业
***********************/
var downlist_notFinanceFirst_array=new Array(
	["NA","请选择..."],
	["0100","企业规模"],
	["0200","流动性"],
	["0300","资本结构"],
	["0400","现金流"],
	["0500","短期偿债能力"],
	["0600","长期偿债能力"],
	["0700","盈利能力"],
	["0800","营运效率"],
	["0900","发展趋势"],
	["0000","一般企业模型财务比率"],
	["1000","财务预测"],
	["1100","EBITDA"],
	["1200","营运资金借款分析"],
	["1300","其他经营活动现金流"],
	["1400","基于现金的债务保障倍数"],
	["1500","固定资产借款分析"],
	["1600","其他资金来源和运用"]
);
/***********************
32.财务比率_非金融二级[一级指标代码,一级指标名称,二级指标代码,二级指标名称,二级指标计算公式文字描述]
***********************/
var downlist_notFinanceSecond_array=new Array(
	["NA","请选择...","NA","请选择...",""],
	["0100","企业规模","EBIT","EBIT(万元)","营业收入-营业成本-营业税金及附加+其他业务利润-销售费用-管理费用+投资收益-资产减值损失+公允价值变动收益"],
	["0100","企业规模","EBITDA","EBITDA(万元)","EBIT+固定资产折旧+无形资产摊销+待摊费用减少"],
	["0100","企业规模","Turnover","营业收入净额(万元)",""],
	["0100","企业规模","Oprt_prft","营业利润(万元)",""],
	["0100","企业规模","Tot_Asst","总资产(万元)",""],
	["0100","企业规模","Wrkg_Cptl","营运资本(万元)","流动资产-流动负债"],
	["0100","企业规模","Tngbl_Net_Asst","有形净资产(万元)","所有者权益-无形资产-商誉-开发支出-长期待摊费用"],
	["0100","企业规模","Tngbl_Tot_Asst","有形资产总额(万元)","资产合计-无形资产-商誉-开发支出-长期待摊费用"],
	["0100","企业规模","Shrt_Debt","短期有息债务(万元)"," 短期借款+交易性金融负债+一年内到期的长期债务"],
	["0100","企业规模","Long_Debt","长期有息债务(万元)","长期借款+应付债券+长期应付款+专项应付款"],
	["0100","企业规模","Tot_Cptl","资本总额(万元)","短期有息债务+长期有息债务+所有者权益"],
	["0100","企业规模","Tot_Eqty","所有者权益(万元)","所有者权益"],
	["0100","企业规模","Oprtg_CF","经营活动现金流(万元)","经营活动产生的现金流量净额"],
	["0100","企业规模","Grss_CF","总现金流(万元)","经营活动产生的现金流量净额-存货的减少-经营性应收项目的减少+经营性应付项目的增加"],
	["0100","企业规模","Rtnd_CF","留存现金流(万元)","经营活动现金流-(无形资产摊销+长期待摊费用摊销)"],
	["0100","企业规模","Free_CF","自由现金流(万元)","留存现金流-购建固定资产、无形资产和其他长期资产支付的现金"],
	["0100","企业规模","Thr_yr_FCF","三年平均自由现金流(万元)","(本年度自由现金流+上年度自由现金流+上两年自由现金流)/3"],
	["0100","企业规模","NET_PROFIT","净利润(万元)","来源于利润表"],
	["0200","流动性","Curr_Ratio","流动比率(X)","流动资产/流动负债"],
	["0200","流动性","Quck_Ratio","速动比率(X)","(货币资金+交易性金融资产+应收票据+应收账款-保证金存款-质押存款)/流动负债"],
	["0200","流动性","Csh_Ratio","现金等价物占有形资产比率(%)","(货币资金+交易性金融资产)/有形资产总额"],
	["0200","流动性","Csh_Days","现金等价销售天数(天)","货币资金/营业收入"],
	["0200","流动性","Turnvr2wrkg_Cptl","营业收入/营运资本(X)","营业收入/流动资产-流动负债"],
	["0200","流动性","CPTL2SHRTDEBT","货币资金/短期付息债务","货币资金/短期付息债务"],
	//["0300","资本结构","inventry2cost","存货占比(%)","存货/营业成本"],
	//["0300","资本结构","Curr_funds2Current_assets","货币资金占比(%)","货币资金/流动资产"],
	["0300","资本结构","Lvrg_Ratio","杠杆比率(X)","负债合计/所有者权益"],
	["0300","资本结构","Liab2Asst","资产负债率(%)","负债合计/资产合计"],
	["0300","资本结构","Liab2Tngbl_Asst","有形资产负债率(%)","负债合计/有形资产合计"],
	["0300","资本结构","Debt2Liab","有息债务/债务总额(%)","(短期有息债务+长期有息债务)/负债合计"],
	["0300","资本结构","Debt2Cptl","有息债务/资本总额(%)","(短期有息债务+长期有息债务)/资本总额"],
	["0300","资本结构","LngAsst2LngLiab","长期资产适合率(%)","(资产总计-流动负债)/(资产总计-流动资产)"],
	["0300","资本结构","Adj_Liab2Tngbl_Asst","调整后的有形资产负债率(%)","(负债合计+经营性租赁承诺+财务担保+法律诉讼或税务申索金额+资本支出承诺+其他表外负债)/(有形资产总额+资本支出承诺)"],
	["0300","资本结构","Wrkg_Cptl2Tngbl_Asst","营运资金/有形资产总额(%)","营运资本/有形资产总额"],
	["0300","资本结构","Fxd_Asst_Ratio","固定资产比率(%)","固定资产合计/资产总计"],
	["0300","资本结构","CURR2TOTASST","流动资产/总资产","流动资产/资产"],
	["0300","资本结构","NETDEBT2TOT_EQTY","净债务权益比","有息债务-货币资金/所有者权益"],
	["0300","资本结构","OPRTG_CF_INTRST_COV","现金流利息覆盖倍数","经营活动净现金流/利息支出"],
	["0400","现金流","Free_CF2EBITDA","自由现金流/EBITDA(X)","自由现金流/EBITDA"],
	["0400","现金流","Free_CF2Turnvr","自由现金流/营业收入(X)","自由现金流/营业收入净额"],
	["0400","现金流","Rtnd_CF2Capex","留存现金流/资本支出(X)","留存现金流/购建固定资产、无形资产和其他长期资产支付的现金"],
	["0400","现金流","OPRTGCF2CURRTDEBT","现金流动负债比","现金流动负债比=经营性现金流量净额/流动负债"],
	["0400","现金流","OPRTGCF2LONGDEBT","经营性现金流量净额/长期付息债务","经营性现金流量净额/长期付息债务"],
	["0400","现金流","OPRTGCF2SHRTDEBT","经营性现金流量净额/短期付息债务","经营性现金流量净额/短期付息债务"],
	["0400","现金流","OPRTGCF2FXDASST","经营性现金流量净额/购建固定资产等长期资产所支付的现金","经营性现金流量净额/购建固定资产等长期资产所支付的现金"],
	["0400","现金流","ALL_CASH_RATIO","全部现金流量比率","经营活动现金净流量/（筹资现金流出+投资现金流出）"],
	["0500","短期偿债能力","EBIT_Intrst_Cov","EBIT利息保障倍数(X)","EBIT/利息支出"],
	["0500","短期偿债能力","EBITDA_Intrst_Cov","EBITDA利息保障倍数(X)","EBITDA/利息支出"],
	["0500","短期偿债能力","EBITDA_FxdExpns_Cov","EBITDA固定支出保障倍数(X)","EBITDA/(利息支出+租金)"],
	["0500","短期偿债能力","Oprtg_CF_FxdExpns_Cov","经营活动现金流固定支出保障倍数(X)","经营活动现金流净额/(利息支出+租金)"],
	["0500","短期偿债能力","Oprtg_CF_Debt_Cov","现金流债务覆盖比率(X)","经营活动现金流净额/(一年内到期的非流动资产+利息支出)"],
	["0500","短期偿债能力","Csh2Curr_Liab","现金及短期投资/短期债务(X)","(货币资金+交易性金融资产-保证金存款-质押存款)/流动负债合计"],
	["0600","长期偿债能力","Rtnd_CF2Debt","留存现金流/有息债务(X)","留存现金流/(短期有息债务+长期有息债务)"],
	["0600","长期偿债能力","FCF2Tot_Liab","三年平均自由现金流/负债合计(X)","三年平均自由现金流/负债合计"],
	["0600","长期偿债能力","FCF2Adj_Tot_Liab","三年平均自由现金流/调整后的负债合计(X)","三年平均自由现金流/(表内负债合计+表外负债合计)"],
	["0600","长期偿债能力","EBITDA_DEBT_COV","EBITDA债务保障倍数","EBITDA债务保障倍数"],
	["0700","盈利能力","Operating_profit_mrgn","营业利润率(%)","(营业利润-投资收益)/营业收入"],
	["0700","盈利能力","Grss_Mrgn","毛利润率(%)","1-营业成本/营业收入"],
	["0700","盈利能力","EBITDA_Mrgn","EBITDA 利润率(%)","EBITDA/营业收入净额"],
	["0700","盈利能力","EBIT_Mrgn","EBIT利润率(%)","EBIT/营业收入净额"],
	["0700","盈利能力","Net_Mrgn","净利润率(%)","净利润/营业收入"],
	["0700","盈利能力","Tot_Asst_Rtrn","总资产收益率(%)","利润总额/资产总计"],
	["0700","盈利能力","TngblAsst_Rtrn","有形资产收益率(%)","利润总额/有形资产总额"],
	["0700","盈利能力","NetAsst_Rtrn","净资产收益率(%)","净利润/所有者权益"],
	["0700","盈利能力","Mng_Expns_Ratio","管理费用比率(%)","管理费用/营业收入"],
	["0700","盈利能力","Non_Csh_Expns_Ratio","非现金支出比率(%)","(固定资产折旧、油气资产折耗、生产性生物资产折旧+无形资产摊销+长期待摊费用摊销)/营业收入"],
	["0700","盈利能力","Csh2Liab","现金负债总额比率(%)","经营活动现金流量净额/负债总额"],
	["0700","盈利能力","DEBT2EBITDA","调整后的有息债务/EBITDA(X)","(短期有息债务+长期有息债务-货币资金)/EBITDA"],
	["0700","盈利能力","EXC_NON_REC_OPER_PROFIT_MRGN","剔除非经常性损益后的营业利润率(%)","(营业利润-投资收益-公允价值变动收益-资产减值损失-汇兑损益)/营业总收入"],
	["0800","营运效率","AR_Day","应收帐款周转天数(天)","(应收帐款净额+应付票据)/(营业收入*(1-现金销售比例))*365"],
	["0800","营运效率","Invntry_Day","存货周转天数(天)","存货/营业成本*365"],
	["0800","营运效率","AP_day","应付帐款周转天数(天)","(应付帐款净额+应付票据)/营业成本*365"],
	["0800","营运效率","Tot_Asst_Turnvr","总资产周转率(次)","营业收入/资产总计"],
	["0800","营运效率","Fxd_Asst_Turnvr","固定资产周转率(次)","营业收入/(固定资产合计-在建工程-工程物资-固定资产清理)"],
	["0800","营运效率","TbgblAsst_Turnvr","有形资产周转率(次)","营业收入/有形资产总额"],
	["0800","营运效率","Trd_day","贸易经营周期(天)","应收帐款周转天数+存货周转天数-应付帐款周转天数"],
	["0900","发展趋势","Tot_Asst_Grwth","总资产增长率(%)","期末资产总计/期初资产总计-1"],
	["0900","发展趋势","Sale_Grwth","营业收入增长率(%)","期末营业收入/期初营业收入-1"],
	["0900","发展趋势","Com_Sale_Grwth","营业收入连续三年复合增长率(%)","(本年营业收入/上两年营业收入)的算术平方根-1"],
	["0900","发展趋势","EBITDA_Grwth","EBITDA增长率(%)","期末EBITDA/期初EBITDA-1"],
	["0900","发展趋势","EBIT_Grwth","EBIT增长率(%)","期末EBIT/期初EBIT-1"],
	["0900","发展趋势","TOT_EQTY_GRWTH","所有者权益增长率","所有者权益增长率"],
	["0000","一般企业模型财务比率","m_ratio_1","有息债务占资本比例(%)","(短期有息债务+长期有息债务)/资本总额"],
	["0000","一般企业模型财务比率","m_ratio_2","短期债务占资本比例(%)","短期有息债务/资本总额"],
	["0000","一般企业模型财务比率","m_ratio_3","营业利润率三年平均值(%)","(营业利润/营业收入)的三年平均值"],
	["0000","一般企业模型财务比率","m_ratio_4","资本收益率(%)","利润总额/资本总额"],
	["0000","一般企业模型财务比率","m_ratio_5","现金流违约距离(X)","(经营活动现金流净额三年平均值-经营活动现金流净额的三年标准差)/负债合计"],
	["0000","一般企业模型财务比率","m_ratio_6","应收帐款及存货周转率(%)","(应收账款净额+存货)/营业收入"],
	["0000","一般企业模型财务比率","m_ratio_7","模型所有者权益(万元)","max(所有者权益(万元)/680+1000,0.001)"],
	["0000","一般企业模型财务比率","m_ratio_8","资产负债率三年增加值(%)","如果(期末资产负债率-上两期的资产负债率)<0.15,则为1,否则则为0"],
	["0000","一般企业模型财务比率","industry_group","行业分组","根据发行人行业取后台配置的行业评分"],
	["0000","一般企业模型财务比率","Shrt_Debt2Debt","短期债务占总有息债务比率(%)","短期有息债务/max(总有息债务,1)"],
	["0000","一般企业模型财务比率","aver_EBITDA_Mrgn","EBITDA利润率三年平均值(%)","(EBITDA/营业收入)三年平均值"],
	["0000","一般企业模型财务比率","asst_rewd","资产回报率(%)","净利润 /资产合计"],
	["0000","一般企业模型财务比率","cur_mrgn","流动性比率(%)","(现金及现金等价物+交易性金融资产)/(营业成本+管理费用+财务费用)"],
	["1000","财务预测","COS_Ratio","营业成本比率(%)",""],
	["1000","财务预测","Sale_tax","营业税比率(%)",""],
	["1000","财务预测","Other_Rev","其他业务收入比率(%)",""],
	["1000","财务预测","Sell_Fee","销售费用比率(%)",""],
	["1000","财务预测","GA_Fee","管理费用比率(%)",""],
	["1000","财务预测","Inv_Inc","投资收益比率",""],
	["1000","财务预测","Asst_Prv","资产减值损失(减值准备)比率",""],
	["1000","财务预测","Depre_Ratio","平均折旧率(%)",""],
	["1000","财务预测","Interest_rate","平均利息率(%)",""],
	["1000","财务预测","Tax_rate","平均所得税率(%)",""],
	["1000","财务预测","Dvd_Ratio","普通股利(%)",""],
	["1000","财务预测","cash_Ratio","现金比率(%)",""],
	["1000","财务预测","Capex","资本支出(万元)",""],
	["1000","财务预测","R&D","开发支出(万元)",""],
	//["1000","财务预测","ST_LT_Debt","长短期有息债务比例(%)",""],
	["1100","EBITDA","EBITDA","EBITDA(万元)","营业收入-营业成本-营业税金及附加+其他业务利润-销售费用-管理费用+投资收益-资产减值损失+公允价值变动收益+固定资产折旧+无形资产摊销+待摊费用减少"],
	["1200","营运资金借款分析","Sale_Grwth","营业收入增长率(%)","期末营业收入/期初营业收入-1"],
	["1200","营运资金借款分析","AR_Dec","应收账款减少(增加)数(万元)","(期初应收票据+期初应收账款-期末应收票据-期末应收账款)"],
	["1200","营运资金借款分析","AR_Dec_Estmt","与营业收入匹配的应收账款增减(万元)","期初应收票据+期初应收账款-期末营业收入*期初应收账款周转天数/365"],
	["1200","营运资金借款分析","Inv_Dec","存货减少(增加)数(万元)","期初存货-期末存货"],
	["1200","营运资金借款分析","Inv_Dec_Estmt","与营业成本匹配的存货变化(万元)","期初存货-期末营业成本*期初存货周转天数/365"],
	["1200","营运资金借款分析","Op_Fin_Invst","新增于应收账款和存货的投资(万元)","(应收账款减少(增加)数+存货减少(增加)数)*(-1)"],
	["1200","营运资金借款分析","AR_Inv_Add","应收账款和存货增长率(%)","(期末应收账款+期末应收票据+期末存货)/(期初应收账款+期初应收票据+期初存货)-1"],
	["1200","营运资金借款分析","AP_Inc","应付账款增加(减少)数(万元)","(期末应付票据+期末应付账款-期初应付票据-期初应付账款)"],
	["1200","营运资金借款分析","ST_Loan_Add","短期借款增加(减少)数(万元)","期末短期借款+期末交易性金融负债-期初短期借款-期初交易性金融负债 "],
	["1200","营运资金借款分析","OP_Fin_Add","营运资金融资额(万元)","应付账款增加(减少)数+短期借款增加(减少)数"],
	["1200","营运资金借款分析","Dif_Op_Fin","营运资金融资和运用的差额(万元)","营运资金融资额-新增于应收账款和存货的投资"],
	["1200","营运资金借款分析","Adj_EBITDA","营运资金调整后的EBITDA(万元)","EBITDA-新增于应收账款和存货的投资+应付账款增加(减少)数"],
	["1300","其他经营活动现金流","OP_Inc_Othr","其他经营性应收应付项目的变化(万元)","期初预付款项-期末预付款项+期末预收款项+期末应付职工薪酬+期末应交税费-(期初预收款项+期初应付职工薪酬+期初应交税费)"],
	["1300","其他经营活动现金流","Tax","支付的所得税款(万元)","(期末所得税费用-期末递延所得税负债+期初递延所得税负债-期初递延所得税资产+期末递延所得税资产)"],
	["1300","其他经营活动现金流","Csh_Othr","其他现金项目(万元)","经营活动产生的现金流量净额-(营运资金调整后的EBITDA+其他经营性应收应付项目的变化-支付的所得税款)"],
	["1300","其他经营活动现金流","CF001","经营活动产生的现金流净额(万元)","经营活动产生的现金流量净额"],
	["1400","基于现金的债务保障倍数","CPLTD","一年内到期的长期负债(期初)(万元)","期初一年内到期的非流动负债"],
	["1400","基于现金的债务保障倍数","DVDND","红利(万元)","应付优先股股利+应付普通股股利"],
	["1400","基于现金的债务保障倍数","CFADA","偿还债务后的现金流(万元)","经营活动产生的现金流量净额-一年内到期的长期负债-红利-利息支出"],
	["1400","基于现金的债务保障倍数","DSR_CFADA","现金债务保障倍数","经营活动产生的现金流量净额/(一年内到期的长期负债+利息支出)"],
	["1500","固定资产借款分析","NCAST_Add","非流动资产增加(减少)数(万元)","(期末非流动资产合计-期初非流动资产合计+固定资产折旧+无形资产摊销+待摊费用减少)"],
	["1500","固定资产借款分析","LTD_Add","非流动负债增加(减少)数(万元)","(期末非流动负债合计-期初非流动负债合计+期末一年内到期的非流动负债)"],
	["1500","固定资产借款分析","Dif_NC_Fin","非流动资产融资和运用差额(万元)","非流动负债增加(减少)数-非流动资产增加(减少)数；"],
	["1500","固定资产借款分析","Capex2","资本支出(万元)","资本支出(万元)"],
	["1500","固定资产借款分析","Dif_CAP","资本支出后的现金流(万元)","偿还债务后的现金流+短期借款增加(减少)数+非流动资产融资和运用差额"],
	["1500","固定资产借款分析","brow_cap_ratio","借款占资本支出的比例","非流动负债增加(减少)数/资本支出"],
	["1600","其他资金来源和运用","NR_Incm","营业外收益(万元)","(营业外收入-营业外支出)"],
	["1600","其他资金来源和运用","Eqty_Add","股东投资变化(万元)","(期末实收资本+期末资本公积+期末少数股东权益-期初实收资本-期初资本公积-期初少数股东权益)"],
	["1600","其他资金来源和运用","long_inv_chage","长期投资变化(万元)","(期初长期投资合计-期末长期投资合计)"],
	["1600","其他资金来源和运用","Inv_inc","投资收益(万元)","投资收益"],
	["1600","其他资金来源和运用","Fund_Surc_Oth","其他资金来源","(期末其他应付款+期末其他流动负债-期初其他应付款-期初其他流动负债+期末利息支出-期末财务费用+期末应付利息+期末应付股利-期初应付利息-期初应付股利)"],
	["1600","其他资金来源和运用","Csh_Add","现金和交易性金融资产的增减数(万元)","(期末货币资金+期末交易性金融资产-期初货币资金-期初交易性金融资产)"],
	["1600","其他资金来源和运用","Fund_use_Oth","其他资金运用","(期末应收利息+期末应收股利+期末其他应收款+期末一年内到期的非流动资产+期末其他流动资产+期末库存股+期末外币报表折算差额-(期初应收利息+期初应收股利+期初其他应收款+期初一年内到期的非流动资产+期初其他流动资产+期初库存股+期初外币报表折算差额))"],
	["1600","其他资金来源和运用","Dif_Oth","其他资金来源和运用差额(万元)","营业外收益+股东投资变化+其他资金来源+长期投资变化+投资收益-现金和交易性金融资产的增加(减少)数-其他资金运用"],
	["1600","其他资金来源和运用","csh_surc","现金总来源(万元)",""],
	["1600","其他资金来源和运用","csh_use","现金总支出(万元)",""],
	["1600","其他资金来源和运用","dif_csh","现金总差额(万元)",""],
	["1600","其他资金来源和运用","dif_csh_rat","总差额占现金总来源的比例(%)",""]
);
/***********************
33.数据来源
***********************/
var downlist_dataSource_array=new Array(
	["PI","系统录入"],
	["EI","EXCEL导入"],
	["DB","数据中心"]
);
/***********************
34.评分表层数 	downlist_TierFinCount
***********************/
var downlist_TierFinCount=new Array(
	["2","2"],
	["3","3"],
	["4","4"],
	["5","5"]
);
/***********************
36.电子邮件发送人或接收人 	downlist_email_R_C(N表示不接收,R表示接收人,C表示抄送人)
	电子邮件发送人或接收人 	downlist_email_R_C(N表示不接收,R表示接收人)
***********************/
var downlist_email_R_C=new Array(
	["R","接收人"],
	["C","抄送人"]
);
/***********************
36-1  组合管理预警通知设置 combina_earlyWarning_value(-3表示上调3级，-2表示上调2级)
      组合管理预警通知设置 combina_earlyWarning_value(-1表示上调1级，0表示不预警，1表示下调1级)
      组合管理预警通知设置 combina_earlyWarning_value(2表示下调2级，3表示下调3级)
************************/
var combina_earlyWarning_value =new Array(
	["-3","上调3级"],
	["-2","上调2级"],
	["-1","上调1级"],
	["0","不预警"],
	["1","下调1级"],
	["2","下调2级"],
	["3","下调3级"]
);
/***********************
36-2组合管理预警级别   combina_earlyWarning(N表示不通知，Y表示通知)
************************/
var combina_earlyWarning=new Array(
	["N","不通知"],
	["Y","通知"]
);
/***********************
37.转换公式	downlist_transfer_function
***********************/
var downlist_transfer_function=new Array(
	["x","x"],
	["ax+b","ax+b"],
	["ln(ax+b)","ln(ax+b)"]
);
/***********************
38.查看频率 	downlist_frequency_function
***********************/
var downlist_frequency_function	=new Array(
	["1","月"],
	["3","季度"],
	["6","半年"],
	["12","1年"],
	["24","2年"],
	["36","3年"],
	["48","4年"],
	["60","5年"]
);
/***********************
39.评级支持--集团支持---核心--级别调整规则 	downlist_comp_core_function
***********************/
var downlist_comp_core_function	=new Array(
	["TRP111","调整到集团级别"],
	["TRP112","与集团级别相差一级"],
	["TRP113","与集团级别相差两级"]
);
/***********************
40.评级支持--集团支持---重要--级别调整规则 	downlist_comp_import_function
***********************/
var downlist_comp_import_function	=new Array(
	["TRP121","调整三级但与集团级别相差一级"],
	["TRP122","调整三级但与集团级别相差两级"],
	["TRP123","调整两级但与集团级别相差一级"],
	["TRP124","调整两级但与集团级别相差两级"],
	["TRP125","调整一级但与集团级别相差一级"],
	["TRP126","调整一级但与集团级别相差两级"]
);
/***********************
41.评级支持--集团支持---一般--级别调整规则 	downlist_comp_commonly_function
***********************/
var downlist_comp_commonly_function	=new Array(
	["TRP131","调整两级但与集团级别相差一级"],
	["TRP132","调整两级但与集团级别相差两级"],
	["TRP133","调整一级但与集团级别相差一级"],
	["TRP134","调整一级但与集团级别相差两级"]
);
/***********************
42.评级支持--集团支持---无关--级别调整规则 	downlist_comp_independent_function
***********************/
var downlist_comp_independent_function	=new Array(
	["TRP141","不调整级别"]
);
/***********************
43.评级支持--政府支持---完全支持--级别调整规则 	downlist_gov_complete_function
***********************/
var downlist_gov_complete_function	=new Array(
	["GOV211","等同于政府评级"],
	["GOV212","与政府级别差一级"],
	["GOV213","与政府级别差两级"]
);
/***********************
44.评级支持--政府支持---重要支持--级别调整规则 	downlist_gov_import_function
***********************/
var downlist_gov_import_function	=new Array(
	["GOV221","上调一级但与政府级别差一级"],
	["GOV222","上调两级但与政府级别差一级"],
	["GOV223","上调三级但与政府级别差一级"],
	["GOV224","上调一级但与政府级别差两级"],
	["GOV225","上调两级但与政府级别差两级"],
	["GOV226","上调三级但与政府级别差两级"]
);
/***********************
45.评级支持--政府支持---一般支持--级别调整规则 	downlist_gov_commonly_function
***********************/
var downlist_gov_commonly_function	=new Array(
	["GOV231","上调一级但与政府级别差一级"],
	["GOV232","上调一级但与政府级别差两级"],
	["GOV233","上调一级但与政府级别差三级"]
);
/***********************
46.评级支持--政府支持---无支持--级别调整规则 	  downlist_gov_independent_function
***********************/
var downlist_gov_independent_function	=new Array(
	["GOV241","不调整级别"]
);
/************************
48.债券－交易市场 downlist_exchange_place_array
 *************************/
var downlist_exchange_place_array = new Array(
	["1","未上市"],
	["2","非交易所交易"],
	["3","深交所"],
	["4","上交所"],
	["5","港交所"],
	["6","银行间"],
	["7","固定收益平台"]
);
/************************
48.1. 交易市场 downlist_market_array
*************************/
var downlist_market_array = new Array(
	["M001","深圳"],
	["M002","上海"],
	["M003","香港"],
	["M004","纽约"],
	["M005","新加坡"],
	["M006","台湾"],
	["M007","东京"],
	["M008","纽约"],
	["M009","其他"]
);
/************************
49.信用评级－债券－优先/次级 downlist_debt_level_array
*************************/
var downlist_debt_level_array = new Array(
	["10","优先"],
	["11","次级"]
);
/************************
50.债券池 downlist_bond_pool_array
*************************/
var downlist_bond_pool_array = new Array(
	["AL","全部"],
	["JX","精选"],
	["PT","普通"],
	["JT","禁投"]
);
/************************
51.评级模板－严重性-- downlist_index_effect_array
*************************/
var downlist_index_effect_array = new Array(
	["red","红灯"],
	["yellow","黄灯"],
	["green","绿灯"]
);
/************************
52.评级模板－下调评级数目 -- downlist_pdown_rating_array
*************************/
var downlist_pdown_rating_array = new Array(
	["0","0"],
	["1","1"],
	["2","2"],
	["3","3"],
	["4","4"],
	["5","5"],
	["6","6"],
	["7","7"],
	["8","8"],
	["9","9"],
	["10","10"],
	["11","11"],
	["12","12"],
	["13","13"],
	["14","14"],
	["15","15"],
	["16","16"],
	["17","17"],
	["18","18"],
	["19","19"],
	["20","20"]
);
/************************
52.任务类别 downlist_task_type_array
*************************/
var downlist_task_type_array = new Array(
    ["TF","财务暂存"],
    ["TU","信用评级"],
    ["TM","主体评级"],
    ["TD","债券评级"],
    ["TC","质押变化"]
);
/************************
54.财务比率_金融一级银行	downlist_notBankFirst_array
*************************/
var downlist_notBankFirst_array = new Array(
	["NA","请选择..."],
    ["2100","规模"],
    ["2200","增长比率(%)"],
    ["2300","流动性"],
    ["2400","收入构成"],
    ["2500","盈利能力"],
    ["2600","资产质量"],
    ["2700","资本充足水平"],
    ["2800","市场份额和成长性"],
    ["2900","业务结构"]

);
/************************
55.财务比率_金融二级银行	downlist_notBankSecond_array[一级指标代码,一级指标名称,二级指标代码,二级指标名称,二级指标计算公式文字描述]
*************************/
var downlist_notBankSecond_array=new Array(
	["NA","请选择...","NA","请选择...",""],
	["2100","规模","Tot_Asst","总资产(万元)","资产总计"],
	["2100","规模","total_deposits","存款总额(万元)","存款总额"],
	["2100","规模","total_loans","贷款总额(万元)","贷款总额"],
	["2100","规模","Pre_provision_profit","计提拨备前利润(万元)","(利润总额 + 资产减值损失)"],
	["2100","规模","EQUITY","所有者权益(万元)","(来源于资产负债表)"],
	["2100","规模","REVENUE","营业收入(万元)","(来源于利润表)"],
	["2100","规模","NET_PROFIT","净利润(万元)","(来源于利润表)"],
	["2100","规模","TOTAL_LIAB","总负债(万元)","总负债(万元)"],
	["2100","规模","NET_INTRST_INCOME","利息净收入(万元)","利息净收入(万元)"],
	["2100","规模","NET_FEE_INCOME","手续费及佣金净收入(万元)","手续费及佣金净收入(万元)"],
	["2100","规模","INVEST_INCOME","投资收益(万元)","投资收益(万元)"],
	["2100","规模","FUND_TO_THE_INDUSTRY","同业融出资金(万元)","存放同业款项+拆出+买入返售"],
	["2100","规模","SEC_INVEST","证券投资(万元)","交易性金融资产+可供出售金融资产+持有到期投资+应收款项类投资"],
	["2100","规模","FUND_FROM_THE_INDUSTRY","同业融入资金(万元)","同业存放+拆入+卖出回购"],
	["2100","规模","END_OF_YEAR_INTRST_EARN_ASST","年末生息资产(万元)","现金及存放央行款项+存放同业款项+拆出资金+交易性金融资产+买入返售金融资产+发放贷款及垫款+可供出售金融资产+持有至到期投资+应收款项类投资+贷款减值准备"],
	["2100","规模","END_OF_YEAR_INTRST_BEAR_DEBT","年末有息负债(万元)","同业和其他金融机构存放款项+向中央银行借款+拆入资金+交易性金融负债+卖出回购金融资产款+吸收存款+应付债券"],
	["2100","规模","BOND_REMAIN_BALANCE2EQUITY","债券余额/所有者权益(%)","应付债券/所有者权益"],
	["2200","增长比率(%)","Growth_rate_of_total_assets","总资产增长率(%)","(期末资产总计-期初资产总计)/期初资产总计"],
	["2200","增长比率(%)","Growth_rate_of_loans","贷款余额增长率(%)","(期末贷款总额-期初贷款总额)/期初贷款总额"],
	["2200","增长比率(%)","Growth_rate_of_deposits","存款余额增长率(%)","(期末存款总额-期初存款总额)/期初存款总额"],
	//["2300","流动性","Liquidity_ratio","流动性比率(%)","流动资产/流动负债"],
	["2300","流动性","Loan2deposit_ratio","存贷比(%)","贷款总额/存款总额"],
	["2300","流动性","ASSOC_LOAN_RATIO","关联方贷款比率(%)","手工维护"],
	["2300","流动性","NET_BORR_RATIO","净拆借资金比率(%)","净拆借资金比率=(拆入资金余额-拆出资金余额)/各项存款余额"],
	["2300","流动性","SUP_RESERVE_RATIO","超额准备金率(%)","手工维护"],
	["2300","流动性","LIQ_RATE","流动比率(%)","流动比率=流动资产/流动负债"],
	["2300","流动性","LIQUID_RATIO2","流动性比率(%)-手工","手工维护"],
	["2300","流动性","LIQUID_RATIO_RMB","流动性比率(人民币)(%)","手工维护"],
	["2300","流动性","LIQUID_RATIO_FORGN","流动性比率(外币)(%)","手工维护"],
	["2300","流动性","NET_FUND_OUT_INDUSTRY","同业净融出资金(万元)","同业融出资金-同业融入资金"],
	["2300","流动性","PROP_OF_HIGH_LIQUID_ASST","高流动性资产占比(%)","(现金及存放央行款项+同业融出资金+证券投资)/总资产"],
	["2300","流动性","PROPORTION_OF_BORROW_FUND","拆入资金比例(%)","拆入资金/吸收存款"],
	["2300","流动性","PROPORTION_OF_LOAN_OUT","拆出资金比例(%)","拆出资金/吸收存款"],
	["2300","流动性","EXCESS_RESERVE_RATIO","备付金比例(%)","手工维护"],
	["2300","流动性","CORE_DEBT_DEPEN_RATIO","核心负债依存度(%)","手工维护"],
	["2300","流动性","LIQUID_GAP_RATIO","流动性缺口率(%)","手工维护"],
	["2300","流动性","FOREIGN_EXC_OPEN_POSIT_RATIO","累计外汇敞口头寸比例(%)","手工维护"],
	["2300","流动性","INTRST_RISK_SEN_RATIO","利率风险敏感度(%)","手工维护"],
	["2400","收入构成","Net_interest_proportion","利息净收入占比(%)","利息净收入/营业收入"],
	["2400","收入构成","Fee_income_accounted","手续费收入占比(%)","手续费和佣金净收入/营业收入"],
	["2400","收入构成","Investment_income_accounted","投资收益占比(%)","投资收益/营业收入"],
	["2500","盈利能力","total_return_on_equity","总资产收益率(减值准备前)(%)","计提拨备前利润*2/(期末总资产+期初总资产)"],
	["2500","盈利能力","Return_on_equity","净资产收益率(%)","净利润*2/(期末股东权益+期初股东权益)"],
	["2500","盈利能力","Loan_net_interest_yield","贷款净利息收益率(%)","利息净收入*2/(期末贷款总额+期初贷款总额)"],
	["2500","盈利能力","EXPENSE_RATIO_OF_ASSETS","资产费用率(%)","营业费用/平均总资产"],
	["2500","盈利能力","INTRST_ASST_AVE_RTRN","生息资产平均收益率(%)","本期利息收入/(本期末生息资产+上期末生息资产)*2"],
	["2500","盈利能力","INTRST_DEBT_AVE_INTRST_RATE","计息负债平均付息率(%)","本期利息支出/(本期末计息负债+上期末计息负债)*2"],
	["2500","盈利能力","NET_INTRST_RTRN_MRGN","净利差(%)","生息资产平均收益率-计息负债平均付息率"],
	["2500","盈利能力","NET_INTRST_MRGN","净息差(%)(平均)","净利息收入/(本期末生息资产+上期末生息资产)*2"],
	["2500","盈利能力","COST_INCOME_RATIO","成本收入比(%)","(管理费用+折旧)/营业收入"],
	["2500","盈利能力","BEF_PRO_FOR_RISK_ASST_RTRN","加权风险资产拨备前收益率(%)(平均)","拨备前利润/(本期末加权风险资产+上期末加权风险资产)*2"],
	["2500","盈利能力","BEF_PRO_FOR_ASST_RTRN","拨备前资产收益率(%)","拨备前资产收益率=拨备前净营业利润/平均总资产"],
	//["2600","资产质量","Non_performing_loan_ratio","不良贷款率(%)","不良贷款余额/贷款总额"],
	//["2600","资产质量","Provision_coverage","拨备覆盖率(%)","贷款减值准备/不良贷款余额"],
	["2600","资产质量","NON_CRED_ASST_LOSS_RATIO","非信贷资产损失率(%)","手工维护"],
	["2600","资产质量","PROVISION_COVERAGE2","拨备覆盖率(%)","手工维护"],
	["2600","资产质量","NORM_LOAN2LOAN","正常类贷款占比(%)","正常类贷款/贷款和垫款总额"],
	["2600","资产质量","MENT_LOAN2LOAN","关注类贷款占比(%)","关注类贷款/贷款和垫款总额"],
	["2600","资产质量","SUBPRI_LOAN2LOAN","次级类贷款占比(%)","次级类贷款/贷款和垫款总额"],
	["2600","资产质量","DOUBT_LOAN2LOAN","可疑类贷款占比(%)","可疑类贷款/贷款和垫款总额"],
	["2600","资产质量","LOSS_LOAN2LOAN","损失类贷款占比(%)","损失类贷款/贷款和垫款总额"],
	["2600","资产质量","NON_PERFORM_LOANS_RAT","五级分类不良贷款率(%)","手工维护"],
	["2600","资产质量","NON_PEFORM_MENT_LOAN2LOAN","不良+关注类贷款率(%)","100-正常类贷款占比"],
	["2600","资产质量","LOAN_LOSS_PROVI_RATIO","贷款损失准备充足率(%)","贷款减值准备余额/专项准备应计提额"],
	["2600","资产质量","ALLOT_LOAN2LOAN","拨贷比(%)","贷款减值准备余额/总贷款"],
	["2600","资产质量","NON_PERFORM_LOAN_PRODUC_RATE","不良贷款生成率(%)","(期末不良贷款余额-上期不良贷款余额-本期核销-本期转出-本期转回)/(本期末贷款和垫款总额-上期末垫款和垫款总额)"],
	["2600","资产质量","ASST_LOSS2AVE_ASST","本年资产减值损失/平均资产余额(%)","本年资产减值损失/平均资产余额(%)"],
	["2600","资产质量","SINGLE_GROUP_CREDIT_RATE","单一集团客户授信比例(%)","手工维护"],
	["2600","资产质量","SINGLE_LARGEST_LOAN_RATE","单一最大客户贷款比例(%)","手工维护"],
	["2600","资产质量","TOP_TEN_CUSTOMER_LOAN_RATE","最大十家客户贷款比例(%)","手工维护"],
	["2600","资产质量","ASSOCIAT_CREDIT_RATE","关联授信比例(%)","手工维护"],
	["2600","资产质量","NON_PERFORM_LOAN_GRWTH","不良贷款增速(%)","本期末不良贷款余额/上期末不良贷款余额-1"],
	["2600","资产质量","NORM_LOAN_MIGRAT_RATE","正常类贷款迁徙率(%)","手工维护"],
	["2600","资产质量","MENT_LOAN_MIGRAT_RATE","关注类贷款迁徙率(%)","手工维护"],
	["2600","资产质量","SUBPRI_LOAN_MIGRAT_RATE","次级类贷款迁徙率(%)","手工维护"],
	["2600","资产质量","DOUBT_LOAN_MIGRAT_RATE","可疑类贷款迁徙率(%)","手工维护"],
	["2600","资产质量","RISK_ASST2TOT_ASST","加权风险资产/总资产(%)","加权风险资产/总资产"],
	["2600","资产质量","PROPORTION_OUTSIDE_ASST","表外资产占比(%)","表外资产/总资产"],
	["2600","资产质量","PROPORTION_OVERDUE_LOAN","逾期贷款占比(%)","逾期贷款/贷款及垫款余额"],
	["2700","资本充足水平","Capital_adequacy_ratio","资本充足率(%)","资本净额/风险加权资产"],
	["2700","资本充足水平","core_capital_adequacy_ratio","核心资本充足率(%)","核心资本净额/风险加权资产"],
	["2700","资本充足水平","TOT_EQUITY2TOT_ASST","总权益/总资产(%)","所有者权益/总资产"],
	["2800","市场份额和成长性","DEPOSIT_MARKET_SHARE","存款市场份额(%)","手工维护"],
	["2800","市场份额和成长性","LOAN_MARKET_SHARE","贷款市场份额(%)","手工维护"],
	["2800","市场份额和成长性","DEBT_GRWTH","负债增速(%)","本期末总负债/上期末总负债-1"],
	["2800","市场份额和成长性","REVENUE_GRWTH","营业收入增速(%)","本期营业收入/上年同期营业收入-1"],
	["2800","市场份额和成长性","MANAGE_FEE_GRWTH","管理费用增速(%)","本期管理费用/上年同期管理费用-1"],
	["2800","市场份额和成长性","PRE_PROVISION_PROFIT_GRWTH","拨备前利润增速(%)","本期拨备前利润/上年同期拨备前利润-1"],
	["2800","市场份额和成长性","NET_PROFIT_GRWTH","净利润增速(%)","本期净利润/上年同期净利润-1"],
	["2800","市场份额和成长性","COM_ASST_GRWTH","资产三年复合增长率(%)","(本年资产总额/上两年资产总额)的算术平方根-1"],
	["2800","市场份额和成长性","COM_DEBT_GRWTH","负债三年复合增长率(%)","(本年负债总额/上两年负债总额)的算术平方根-1"],
	["2800","市场份额和成长性","COM_LOAN_GRWTH","贷款三年复合增长率(%)","(本年贷款总额/上两年贷款总额)的算术平方根-1"],
	["2800","市场份额和成长性","COM_DEPOSIT_GRWTH","存款三年复合增长率(%)","(本年存款总额/上两年存款总额)的算术平方根-1"],
	["2900","业务结构","LOAN2TOT_ASST","贷款及垫款/总资产(%)","贷款及垫款/总资产"],
	["2900","业务结构","FUND_TO_INDUSTRY2TOT_ASST","同业融出资金/总资产(%)","同业融出资金/总资产"],
	["2900","业务结构","SEC_INVEST2TOT_ASST","证券投资/总资产(%)","证券投资/总资产"],
	["2900","业务结构","DEPOSIT2LIAB","吸收存款/总负债(%)","吸收存款/总负债"],
	["2900","业务结构","FUND_FROM_THE_INDUSTRY2LIAB","同业融入资金/总负债(%)","同业融入资金/总负债"],
	["2900","业务结构","BOND2LIAB","	债券余额/总负债(%)","应付债券/总负债"],
	["2900","业务结构","CORP_LOAN2LOAN","企业贷款占比(%)","企业贷款/贷款及垫款总额"],
	["2900","业务结构","PERS_LOAN2LOAN","个人贷款占比(%)","个人贷款/贷款及垫款总额"],
	["2900","业务结构","BILL_DISCOUNT2LOAN","票据贴现占比(%)","票据贴现/贷款及垫款总额"],
	["2900","业务结构","SHRT_LOAN2LOAN","短期贷款占比(%)","短期贷款/贷款及垫款总额"],
	["2900","业务结构","LONG_MEDIUM_LOAN2LOAN","中长期贷款占比(%)","中长期贷款/贷款及垫款总额"],
	["2900","业务结构","CORP_DEPOSIT2DEPOSIT","企业存款占比(%)","企业存款/吸收存款"],
	["2900","业务结构","PERS_DEPOSIT2DEPOSIT","个人存款占比(%)","	个人存款/吸收存款"],
	["2900","业务结构","TIME_DEPOSIT2DEPOSIT","定期存款占比(%)","定期存款/吸收存款"],
	["2900","业务结构","CUR_DEPOSIT2DEPOSIT","活期存款占比(%)","活期存款/吸收存款"],
	["2900","业务结构","DERI_FIN_ASST_DERI_FIN_LIAB","衍生金融资产-衍生金融负债(万元)","衍生金融资产-衍生金融负债"]

);
/************************
56.财务比率_金融一级证券   downlist_notSecuritFirst_array
*************************/
var downlist_notSecuritFirst_array = new Array(
	["NA","请选择..."],
    ["3100","规模"],
    ["3200","业务增长"],
    ["3300","盈利能力"],
    ["3400","资本结构"],
    ["3500","资本充足性"]
);
/************************
57.财务比率_金融二级证券	downlist_notSecuritSecond_array[一级指标代码,一级指标名称,二级指标代码,二级指标名称,二级指标计算公式文字描述]
*************************/
var downlist_notSecuritSecond_array=new Array(
	["NA","请选择...","NA","请选择...",""],
	["3100","规模","Tot_Asst","总资产(万元)","资产总计"],
	["3100","规模","Operating_income","营业收入(万元)","营业收入"],
	["3100","规模","Net_assets","净资产(万元)","资产总计-负债合计"],
	["3100","规模","Net_capital","净资本(万元)",""],
	["3200","业务增长","Operating_income_growth_rate","营业收入增长率(%)","(期末营业收入-期初营业收入)/期初营业收入"],
	["3200","业务增长","Operating_profit_growth","营业利润增长率(%)","(期末营业利润-期初营业利润)/期初营业利润"],
	["3300","盈利能力","Operating_margin","营业毛利率(%)","(营业收入-营业支出)/营业收入"],
	["3300","盈利能力","Return_on_equity","净资产收益率(%)","期末净利润*2/(期初净资产+期末净资产)"],
	["3300","盈利能力","Operating_expenses_rate","营业费用率(%)","业务及管理费/营业收入"],
	["3400","资本结构","rate_of_assets_liabilities","资产负债率(%)","(负债合计-代理买卖证券款)/(资产总计-代理买卖证券款)"],
	["3400","资本结构","n_rate_of_assets_liabilities","净资产负债率(%)","(负债合计-代理买卖证券款)/净资产"],
	["3400","资本结构","Interest_bearing_debt","有息债务(万元)","(短期借款+长期借款+交易性金融负债+应付债券+衍生金融负债)/10000"],
	["3400","资本结构","Total_capitalization_ratio","全部资本化比率(%)","有息债务/(有息债务+所有者权益合计)"],
	["3500","资本充足性","Net_capital_ratio","净资本比率(%)","净资本/(负债合计-代理买卖证券款)"],
	["3500","资本充足性","Net_capital2Net_assets","净资本/净资产(X)","净资本/净资产"]
);
/************************
58.财务比率_金融一级保险	downlist_notInsuranceFirst_array
*************************/
var downlist_notInsuranceFirst_array = new Array(
	["NA","请选择..."],
    ["4100","规模"],
    ["4200","增长"],
    ["4300","盈利能力"],
    ["4400","资本充足性"]
);
/************************
59.财务比率_金融二级保险	downlist_notInsuranceSecond_array[一级指标代码,一级指标名称,二级指标代码,二级指标名称,二级指标计算公式文字描述]
*************************/
var downlist_notInsuranceSecond_array=new Array(
	["NA","请选择...","NA","请选择...",""],
	["4100","规模","Tot_Asst","总资产(万元)","资产总计/10000"],
	["4100","规模","Insurance_revenue","保险业务收入(万元)","保险业务收入/10000"],
	["4100","规模","Net_premium_income","净保费收入(万元)","(保险业务收入-分出保费)/10000"],
	["4100","规模","Underwriting_profit","承保利润(万元)","(已赚保费-赔付支出-业务及管理费)/10000"],
	["4100","规模","Investment_Income","投资收益(万元)","投资收益/10000"],
	["4100","规模","Net_profit","净利润(万元)","净利润/10000"],
	["4200","增长","Premium_growth_rate","保费增长率(%)","如果期初报表存在,则为(期末保险业务收入-期初保险业务收入)/期初保险业务收入；否则为空值"],
	["4200","增长","net_premium_growth_rate","净保费增长率(%)","如果期初报表存在,则为(期末净保费-期初净保费)/期初净保费；否则为空值"],
	["4200","增长","Growth_rate_of_total_assets","总资产增长率(%)","如果期初报表存在,则为(期末总资产-期初总资产)/期初总资产；否则为空值"],
	["4300","盈利能力","net_rate_of_return_on_assets"," 净资产回报率(%)","如果期初报表存在,则为期末净利润(万元)*10000*2/(期初股东权益合计 + 期末股东权益合计)；否则为期末净利润(万元)*10000/期末股东权益合计"],
	["4300","盈利能力","total_return_on_equity","总资产收益率(%)","如果期初报表存在,则为期末利润总额/10000*2/(期初总资产+期末总资产)；否则为期末利润总额/10000/期末总资产"],
	["4300","盈利能力","Underwriting_profit_rate","承保利润率(%)","承保利润/净保费收入"],
	["4300","盈利能力","Investment_rate_of_return","投资收益率(%)",""],
	["4300","盈利能力","Premium_collection_rate","保费实收率(%)","1-应收保费/10000/保险业务收入"],
	["4400","资本充足性","Solvency_adequacy_ratio","偿付能力充足率(%)",""],
	["4400","资本充足性","rate_of_assets_liabilities","资产负债率(%)","负债总额/资产总额*100%"],
	["4400","资本充足性","Cover_leverage","承保杠杆比率(%)","净保费收入(万元)*10000/股东权益合计"]
);

/************************
60.财务比率_非金融二级银行Show	downlist_notBankSecondShow_array
*************************/
/************************
61.财务比率_非金融二级证券Show	downlist_notSecuritSecondShow_array
*************************/
/************************
62.财务比率_非金融二级保险Show	downlist_notInsuranceSecondShow_array
*************************/
/************************
/************************
63.财务比率_非金融二级置空   downlist_selectShow_array
*************************/
var downlist_selectShow_array=new Array(
	["","请选择"]
);
/************************
64 异常诊断模版类型        downlist_exception_index_type_array
*************************/
var downlist_exception_index_type_array=new Array(
	["NA","请选择..."],
	["ET","一般企业"]
);
/************************
65.异常诊断-财务比率_非金融一级		downlist_exception_notFinanceFirst_array
*************************/
var downlist_exception_notFinanceFirst_array=new Array(
	["0000","异常诊断指标"]
);
/************************
66.异常诊断-财务比率_非金融二级		downlist_exception_notFinanceSecond_array
*************************/
var downlist_exception_notFinanceSecond_array=new Array(
	/*["0000","异常诊断指标" ,"Accrchgn","应计费用的变化"],
	["0000","异常诊断指标" ,"CAPEXRatio","资本支出比率"],
	["0000","异常诊断指标" ,"OtCARatio","其他流动资产比例"],
	["0000","异常诊断指标" ,"OtCLratio","其他流动负债比例"],*/
	["0000","异常诊断指标" ,"Tax_rate","平均所得税率"],
	// ["0000","异常诊断指标" ,"Tax_pay","(应付税款+期末递延税款贷项-期初递延税款贷项)/所得税"],
	["0000","异常诊断指标" ,"Ot_income","非经营利润率"],
	["0000","异常诊断指标" ,"Ot_LA","其他长期资产比例"],
	["0000","异常诊断指标" ,"Grss_Mrgn","毛利率"],
	["0000","异常诊断指标" ,"Grss_Mrgn_chgn","毛利率增长倍数"],
	["0000","异常诊断指标" ,"AR_chgn","应收帐款增长倍数"],
	["0000","异常诊断指标" ,"Inventory_chgn","存货增长倍数"],
	["0000","异常诊断指标" ,"Accr_ratio","应计项目/资产总额"],
	["0000","异常诊断指标" ,"OCF_Dif","经营现金流差异"],
	//["0000","异常诊断指标" ,"Accr_turn_chgn","应收项目周转率变化"]
	["0000","异常诊断指标" ,"receivable_ratio","应收项目比例"],
	["0000","异常诊断指标" ,"costs_cope_ratio","应付费用比例"],
	["0000","异常诊断指标" ,"Oth_curr_asst_ratio","其他流动资产比例"],
	["0000","异常诊断指标" ,"tax_change","所得税率变化"],
	["0000","异常诊断指标" ,"Tot_Asst_Turnvr_change","资产周转率变化"],
	["0000","异常诊断指标" ,"Grss_Mrgn_change","毛利润率变化"]
);
/************************
68.债券期限 downlist_bond_term
*************************/
var downlist_bond_term = new Array(
	["1","1"],
	["2","2"],
	["3","3"],
	["4","4"],
	["5","5"],
	["6","6"],
	["7","7"],
	["8","8"],
	["9","9"],
	["10","10"],
	["11","11"],
	["12","12"],
	["13","13"],
	["14","14"],
	["15","15"],
	["16","16"],
	["17","17"],
	["18","18"],
	["19","19"],
	["20","20"],
	["21","21"],
	["22","22"],
	["23","23"],
	["24","24"],
	["25","25"],
	["26","26"],
	["27","27"],
	["28","28"],
	["29","29"],
	["30","30"]
);
/************************
47.债券－计息方式 		downlist_interestType_array
*************************/
var downlist_interestType_array = new Array(
    ["0","零息"],
    ["10","固定利率"],
    ["11","浮动利率"],
    ["12","递进利率"],
    ["13","含权债利率"]
);
/************************
69.财务比率_同业比较 downlist_comparision_array
*************************/
var downlist_comparision_array = new Array(
	["Turnover","营业收入净额(万元)"],
	["Tot_Asst","总资产(万元)"],
	["Curr_Ratio","流动比率(X)"],
	["inventry2cost","存货占比"],
	["Curr_funds2Current_assets","货币资金占比"],
	["Liab2Asst","资产负债率(%)"],
	["Debt2Liab","有息债务/债务总额(%)"],
	["EBIT_Intrst_Cov","EBIT利息保障倍数(X)"],
	["Oprtg_CF_FxdExpns_Cov","经营活动现金流固定支出保障倍数(X)"],
	["Operating_profit_mrgn","营业利润率(%)"],
	["Grss_Mrgn","毛利润率(%)"],
	["Tot_Asst_Rtrn","总资产收益率(%)"],
	["AR_Day","应收帐款周转天数(天)"],
	["Invntry_Day","存货周转天数(天)"],
	["AP_day","应付帐款周转天数(天)"],
	["Tot_Asst_Turnvr","总资产周转率(次)"],
	["Sale_Grwth","营业收入增长率(%)"]
);
/***********************
 70.公司性质
***********************/
var downlist_companyProperty_array=new Array(
	["NA","请选择..."],
	["GY","国有控股"],
	["JT","集体企业"],
	["MY","民营企业"],
	["WZ","外资控股"]
);
/*********************
71.抵押品一级分类
*********************/
var downlist_pawnOne_array=new Array(
	["COL01","存款单证"],
	["COL02","贵金属"],
	["COL03","股票"],
	["COL04","债券"],
	["COL05","基金"],
	["COL06","票据"],
	["COL07","权利"],
	["COL08","房产和土地"],
	["COL09","设备"],
	["COL10","其他财产"]
);
/*********************
71.抵押品二级分类
*********************/
var downlist_pawnTwo_array=new Array(
	["COL0101","人民币存单"],
	["COL0102","保本结构性存款证(人民币)"],
	["COL0103","人民币现金"],
	["COL0104","外币存单"],
	["COL0105","外币现汇"],
	["COL0201","黄金"],
	["COL0202","除黄金外贵金属"],
	["COL0301","沪深港主板成分指数样本股"],
	["COL0302","沪深港非成份指数样本股"],
	["COL0303","不通过交易所流通的公司股权"],
	["COL0401","中国政府和人民银行债券/票据"],
	["COL0402","外国政府、中央银行及风险权重为0的多边开发银行发行债券"],
	["COL0403","可在交易所交易的金融债券"],
	["COL0404","不可在交易所交易的金融债券"],
	["COL0405","可在交易所交易的企业/公司债券"],
	["COL0406","不可在交易所交易的企业/公司债券"],
	["COL0501","仅投资于政府债券的公募基金"],
	["COL0502","可投资于各类债券的公募基金"],
	["COL0503","仅投资于主板成份指数样本股的公募基金"],
	["COL0504","可投资于各类在交易所公开交易股票的公募基金"],
	["COL0505","其他基金"],
	["COL0601","商业承兑汇票，原始期限小于1年"],
	["COL0602","商业承兑汇票，原始期限大于1年"],
	["COL0603","银行承兑汇票，原始期限小于1年"],
	["COL0604","银行承兑汇票，原始期限大于1年"],
	["COL0605","银行本票/银行汇票，期限小于1年"],
	["COL0606","银行本票/银行汇票，期限大于1年"],
	["COL0701","公路桥梁、公路隧道、公路渡口收费权"],
	["COL0702","农村电网建设与改造工程电费收费权"],
	["COL0703","其他收费权"],
	["COL0704","国外注册保险公司保单"],
	["COL0705","我国保险公司保单"],
	["COL0706","其他权利"],
	["COL0801","商业营业用房"],
	["COL0802","办公楼"],
	["COL0803","厂房"],
	["COL0804","普通住宅"],
	["COL0805","别墅及高档公寓"],
	["COL0806","划拨的土地使用权"],
	["COL0807","出让的土地使用权"],
	["COL0901","通用机器设备"],
	["COL0902","非通用机器设备"],
	["COL0903","营运车辆"],
	["COL0904","商务车"],
	["COL0905","家用车"],
	["COL0906","其它交通运输工具"]
);
/*********************
73.是EL%/UL%/平均二级市场利差  downlist_ulelma_array
*********************/
var downlist_ulelma_array=new Array(
	["average_market","平均二级市场利差"],
	["el_per","EL%"],
	["ul_per","UL%"]
);
/*********************
74.是否同意  downlist_agreePass_array
*********************/
var downlist_agreePass_array=new Array(
	["Y","同意"],
	["N","拒绝"]
);
/*********************
75.手工调整  downlist_manual_array
*********************/
var downlist_manual_array=new Array(
	["-5","上调5级"],
	["-4","上调4级"],
	["-3","上调3级"],
	["-2","上调2级"],
	["-1","上调1级"],
	["0","保持不变"],
	["1","下调1级"],
	["2","下调2级"],
	["3","下调3级"],
	["4","下调4级"],
	["5","下调5级"]
);
/*********************
76.手工调整  downlist_manual_debt_array
*********************/
var downlist_manual_debt_array=new Array(
	["-10","上调10级"],
	["-9","上调9级"],
	["-8","上调8级"],
	["-7","上调7级"],
	["-6","上调6级"],
	["-5","上调5级"],
	["-4","上调4级"],
	["-3","上调3级"],
	["-2","上调2级"],
	["-1","上调1级"],
	["0","保持不变"],
	["1","下调1级"],
	["2","下调2级"],
	["3","下调3级"],
	["4","下调4级"],
	["5","下调5级"],
	["6","下调6级"],
	["7","下调7级"],
	["8","下调8级"],
	["9","下调9级"],
	["10","下调10级"]
);
/***********************
77.系统控制类型 downlist_control_type(0：不控制；1：IP地址；2：物理地址和IP地址；3：仅物理地址
***********************/
var downlist_control_type=new Array(
	["0","不控制"],
	["1","IP地址"],
	["2","物理和IP地址"],
	["3","物理地址"]
);
/*********************
78.帮助系统问题描述分类  help_theme_typ
*********************/
var help_theme_typ=new Array(
	["D01","建议新功能"],
	["D02","网站评论"],
	["D03","报告问题"]
);
/*********************
78.帮助系统问题描述-建议新功能分类  help_theme_typ_d01_sort
*********************/
var help_theme_typ_d01_sort=new Array(
	["D0101"," 添加新功能  "],
	["D0102"," 功能优化  "],
	["D0103"," 功能建议  "],
	["D0104"," 功能扩展  "]
);
/*********************
78.帮助系统问题描述-网站评论分类  help_theme_typ_d02_sort
*********************/
var help_theme_typ_d02_sort=new Array(
	["D0201"," 业务相关  "],
	["D0202"," 功能相关  "],
	["D0203"," 流程相关  "],
	["D0204"," 美化相关  "]
);
/*********************
78.帮助系统问题描述-问题分类  help_theme_typ_d03_sort
*********************/
var help_theme_typ_d03_sort=new Array(
	["D0301"," 问题缺陷  "],
	["D0302"," 业务问题  "],
	["D0303"," 流程问题  "],
	["D0304"," 程序BUG  "]
);
/*********************
80.公司责任类型  downlist_company_dutyType_array
*********************/
var downlist_company_dutyType_array=new Array(
	["CD01"," 股份有限公司  "],
	["CD02"," 有限责任公司  "],
	["CD03"," 合伙公司  "],
	["CD04"," 独资公司  "]
);
/*********************
81.公司营业范围  downlist_company_business_region_array
*********************/
var downlist_company_business_region_array=new Array(
	["CB01"," 注册地  "],
	["CB02"," 跨省区  "],
	["CB03"," 国际范围  "]
);
/*********************
82.身份证所属地区  downlist_IDCard_region_array
*********************/
var downlist_IDCard_region_array=new Array(
	["ID01"," 中国内地  "],
	["ID02"," 港澳台  "],
	["ID03"," 东南亚及日本韩国  "],
	["ID04"," 其他  "]
);
/*********************
83.教育程度  downlist_education_array
*********************/
var downlist_education_array=new Array(
	["E01"," 初中程度  "],
	["E02"," 高中程度  "],
	["E03"," 大学程度  "],
	["E04"," 研究生及以上程度  "]
);
/*********************
84.婚姻状况  downlist_marriage_status_array
*********************/
var downlist_marriage_status_array=new Array(
	["M01"," 单身  "],
	["M02"," 已婚  "],
	["M03"," 分居  "],
	["M04"," 离婚  "],
	["M05"," 丧偶 "]
);
/*********************
85.住宅所有权  downlist_tenement_ownership_array
*********************/
var downlist_tenement_ownership_array=new Array(
	["T01"," 自置(无按揭) "],
	["T02"," 已按揭  "],
	["T03"," 租用  "],
	["T04"," 直系亲属拥有或租用  "],
	["T05"," 雇主拥有或提供 "],
	["T06"," 其他 "]
);
/*********************
86.是否拥有海外物业或资产  downlist_midsea_materials_array
*********************/
var downlist_midsea_materials_array=new Array(
	["M01"," 有 "],
	["M02"," 没有  "],
	["M03"," 不知道  "]
);
/*********************
87.是否提供收入来源证明  downlist_revenue_origin_prove_array
*********************/
var downlist_revenue_origin_prove_array=new Array(
	["R01"," 是 "],
	["R02"," 否 "],
	["R03"," 豁免  "]
);
/*********************
88.过去三年之负面资信记录  downlist_downside_standing_array
*********************/
var downlist_downside_standing_array=new Array(
	["DS01"," 个人于过去三年发生过放款授信逾期超过7天 "],
	["DS02"," 个人于过去三年发生过支票户过额或退票 "],
	["DS03"," 个人于过去三年发生过法律诉讼  "],
	["DS04"," 个人于过去三年发生过破产  "],
	["DS05"," 个人于过去三年未发生过前述负面情况  "]
);
/*********************
89.授信类别  downlist_credit_type_array
*********************/
var downlist_credit_type_array=new Array(
	["C01"," 新增 "],
	["C02"," 加额 "],
	["C03"," 债务重组 "],
	["C04"," 延期 转期  "],
	["C05"," 减额 一次过调整  "]
);
/*********************
90.审批结论  downlist_approval_conclusion_array
*********************/
var downlist_approval_conclusion_array=new Array(
	["A01"," 同意授信申请  "],
	["A02"," 不同意授信申请 "],
	["A03"," 其他 "]
);
/************************
91.小企业(一般企业)指标类别一级  downlist_small_icommonCategoryFirst_array
************************/
var downlist_small_icommonCategoryFirst_array = new Array(
	["1700","账户行为"]
);
/************************
92.小企业(一般企业)指标类别二级  downlist_small_icommonCategorySecond_array
************************/
var downlist_small_icommonCategorySecond_array = new Array(
	["1700","账户行为","A0","与我行信贷往来年期(年)"],
	["1700","账户行为","A1","过去12个月放款户最长逾期天数"],
	["1700","账户行为","A2","过去12个月押汇户最长逾期天数"],
	["1700","账户行为","A3","过去12个月透支户有否不正常的往来情况"],
	["1700","账户行为","A4","过去12个月信贷记录"],
	["1700","账户行为","A5","有否其他授信的不正常往来记录,法律诉讼等负面信息"],
	["1700","账户行为","A6","过去6个月透支额度使用率%(只适用于拥有透支授信的客户)"],
	["1700","账户行为","A7","过去6个月透支额度活跃比率%(只适用于拥有透支授信的客户)"],
	["1700","账户行为","A8","过去12个月透支额度使用率%(只适用于拥有透支授信的客户)"],
	["1700","账户行为","A9","过去12个月透支额度活跃比率%(只适用于拥有透支授信的客户)"],
	["1700","账户行为","A10","支票户口过去12个月支出总金额(人民币)"],
	["1700","账户行为","A11","支票户口过去12个月存入总金额(人民币)"]
);
/***********************
94. A3:过去12个月透支户有否不正常的往来情况
***********************/
var downlist_overdrawing_account_array=new Array(
	["1","发生过退出票的数量比例多于5%(含)及其累计金额多于3万人民币"],
	["2","发生过退出票的数量比例多于5%(含)及其累计金额多于5万人民币"],
	["3","发生过累计超额多于3万人民币"],
	["4","未发生过前述不良情况"]
);
/***********************
95. A4:过去12个月信贷记录
***********************/
var downlist_financial_credit_array=new Array(
	["1","目前有逾期记录"],
	["2","发生过逾期,但目前已结清"],
	["3","未发生过逾期"]
);
/***********************
96.帮助行业信息类型列表
 ***********************/
var downlist_help_industry_info_type = new Array(
	["I1","世界经济"],
	["I2","宏观经济"],
	["I3","行业政策"],
	["I4","财经新闻"],
	["I5","技术指标"],
	["I6","内部研究"],
	["I7","专家视野"],
	["I8","内部政策"]
);
/***********************
97.状态列表
 ***********************/
var downlist_status_array = new Array(
	["1","有效"],
	["0","无效"]
);
/************************
98.财务比率_政府的事业单位一级	downlist_SY_First_array
*************************/
var downlist_SY_First_array = new Array(
	["NA","未确定..."]
);
/************************
99.财务比率_政府的事业单位二级	downlist_SY_Second_array[一级指标代码,一级指标名称,二级指标代码,二级指标名称,二级指标计算公式文字描述]
*************************/
var downlist_SY_Second_array=new Array(
	["NA","未确定...","NA","未确定...",""]
);
/************************
100.财务比率_政府一级	downlist_ZF_First_array
*************************/
var downlist_ZF_First_array = new Array(
	["NA","未确定..."]
);
/************************
101.财务比率_政府二级	downlist_ZF_Second_array[一级指标代码,一级指标名称,二级指标代码,二级指标名称,二级指标计算公式文字描述]
*************************/
var downlist_ZF_Second_array=new Array(
	["NA","未确定...","NA","未确定...",""]
);
/************************
102.财务比率_多边发展银行一级	downlist_DB_First_array
*************************/
var downlist_DB_First_array = new Array(
	["NA","未确定..."]
);
/************************
103.财务比率_多边发展银行二级	downlist_DB_Second_array[一级指标代码,一级指标名称,二级指标代码,二级指标名称,二级指标计算公式文字描述]
*************************/
var downlist_DB_Second_array=new Array(
	["NA","未确定...","NA","未确定...",""]
);
/************************
104.集团成员	downlist_group_array[母公司，子公司，兄弟公司]
*************************/
var downlist_group_array = new Array(
	["A","母公司"],
	["B","1级子公司"],
	["C","兄弟公司"],
	["D","2级子公司"],
	["E","实际控制人"]
);
/************************
105.成员关系	downlist_relationship_array[全部，有，无]
*************************/
var downlist_relationship_array= new Array(
	["A","全部"],
	["Y","有"],
	["N","无"]
);
/***************************************
A5:有否其他授信的不正常往来记录,法律诉讼等负面信息
***************************************/
var downlist_financial_credityesno_array=new Array(
	["1","有"],
	["2","没有"],
	["3","不知道"]
);
/***************************************
106.文档管理-文件类型    downlist_file_type_array
***************************************/
var downlist_file_type_array=new Array(
	["1","外部评级报告"],
	["2","发行说明书"],
	["3","审批报告"],
	["4","内部评级报告"],
	["5","会议纪要"],
	["6","其他"]
);
//生成下拉框内容,如果下拉框的值与给定的值相等,则选中
function makeSelectOption(array,val,d0Val){
	if(d0Val){
		for(i=0;i<array.length;i++) if(d0Val==array[i][0])
			document.write("<option value=\""+array[i][2]+"\""+(array[i][2]==val?" selected>":">")+array[i][3]+"</option>");
	} else {
		for(var i = 0; i < array.length; i++)
			document.write("<option value=\""+array[i][0]+"\""+(array[i][0]==val?" selected>":">")+array[i][1]+"</option>");
	}
}
//生成下拉框内容,如果下拉框的值与给定的值相等,则选中 从第二个选项开始
function makeSelectOption1(array,val,d0Val){
	if(d0Val){
		for(i=1;i<array.length;i++) if(d0Val==array[i][0])
			document.write("<option value=\""+array[i][2]+"\""+(array[i][2]==val?" selected>":">")+array[i][3]+"</option>");
	} else {
		for(var i = 1; i < array.length; i++)
			document.write("<option value=\""+array[i][0]+"\""+(array[i][0]==val?" selected>":">")+array[i][1]+"</option>");
	}
}
/**
 * 将数组的code对应的名称返回或打印
 * @param array 必选项,数组
 * @param code 可选项
 * @param opt 可选项,操作选项对象{d:0,ret:0,nfd:''}
 * d-Dimension(维度)[code对应数组array中的第几唯(默认为0)];
 * ret-Return(是否返回)[根据code找到对应name后是否返回name,0-打印并返回(默认),1-返回];
 * nfd-noFoundDefault(找不到code对应的name时的默认值)
 * @example: arrayCodeToName(array,'code',{d:0})
 */
function arrayName(array,code,opt){
	opt=opt||{}; opt.d = opt.d||0; opt.ret = opt.ret||0; opt.nfd = opt.nfd||"";
	for(var i=0;i<array.length;i++){
		if(code == array[i][opt.d]){opt.nfd=array[i][opt.d+1];break;}
	}
	if(opt.ret!=1) document.write(opt.nfd);
	return opt.nfd;
}
/**
 * 联动触发下级下拉框列表
 * @param lowerSelID 下级下拉框ID
 * @param lowerArray 下级下拉框要填充的数组,必须为二维数组,每一维为四个元素,如:[["1000","省会1","100001","城市1"],["1000","省会1","100002","城市2"]]
 * @param superCode 上一级下拉框选择的代码,如数组lowerArray中的每一维的第一个元素.
 * @param firstIsAppendAll 是否追加[请选择,全部]字样,0-追加[请选择],1-追加[全部],否则不追加
 * @return
 */
function linkLowerSelect(lowerSelID,lowerArray,superCode,firstIsAppendAll) {
	var selObj = document.getElementById(lowerSelID);
	//清除原有的option
	for(var i=0; i < selObj.options.length;)
		selObj.remove(i);
	//追加新的option
	if(firstIsAppendAll===0||firstIsAppendAll==1){
		firstIsAppendAll = firstIsAppendAll===0?["NA","请选择"]:["NA","全部"];
		selObj.add(new Option(firstIsAppendAll[1],firstIsAppendAll[0]));
	}
	for(var i = 0; i < lowerArray.length; i++){
		if(lowerArray[i][0]==superCode)
			selObj.add(new Option(lowerArray[i][3],lowerArray[i][2]));
	}
}
//根据code获得name(一维)
function getReturnName(array,code){
	var temp = "";
	for(var i=0;i<array.length;i++){
		if(code == array[i][0]){
			temp = array[i][1];
			break;
		}
	}
	return temp;
}
//根据code获得name(二维)
function getFReturnName(array,code){
	var temp = "";
	for(var i=0;i<array.length;i++){
		if(code == array[i][2]){
			temp = array[i][3];
			break;
		}
	}
	return temp;
}